{"kind": "Listing", "data": {"after": null, "dist": 10, "modhash": "", "geo_filter": "", "children": [{"kind": "t3", "data": {"approved_at_utc": null, "subreddit": "datascience", "selftext": "Applying to jobs online is like navigating a maze.\n\nAmidst the special torture that is resume parsing software, the inability to reuse information across different application tracking systems (ATS), and the existence of a certain company that rhymes with every day of the week, it can get pretty frustrating.\n\nI wanted to explore what factors make a job application more or less frustrating.\n\nFor example, what industries have the worst application processes? Do big companies ask for more information than small companies? What is it about websites like Workday that make them really hard to use?\n\nTo answer these questions, I applied to 250 jobs. One by one. Click by click. No Linkedin Easy Apply, no shortcuts – just straight from the careers page.\n\nI timed how long it took me to go from “apply to job” to “submit application”.\n\nhttps://preview.redd.it/adj6ge9jvyxb1.png?width=2820&amp;format=png&amp;auto=webp&amp;s=2123533d9d04aabcdd5988471274ee2ed3b98704\n\nMake no mistake: I sacrificed my soul for this post. I created over 83 accounts and spent a total of 11 hours scrolling. I was originally going to do this for 500 companies, but wanted to chop my head off halfway.\n\nI did this for a mix of companies – Fortune 500 to early stage startups, spread out across different industries from software to manufacturing. The *type* of role I applied to was kept constant: engineering / product focused.\n\nhttps://preview.redd.it/ttn8yd1mvyxb1.png?width=2266&amp;format=png&amp;auto=webp&amp;s=f27a52217e85bfade6eb30f0b696914eac7fc270\n\nThe outcome? An average of over two and a half minutes per application—162 seconds of your life you'll never get back. But as we dig deeper, you'll discover that these 162 seconds only scratch the surface of an often maddening process.\n\n*Key Takeaways*\n\n* **Average Application Time:** On average, it took a bit over two and a half minutes to apply to a job.\n* **Company Size Impact:** If company size doubles, the application time increases by 5%. If company size increases by a factor of 10, then the app time increases by 20%.\n* **Industry Influence:** Being a government company is the single largest determinant of a long application, followed closely by aerospace and consulting firms.\n* **Longest Application:** The longest application time went to the United States Postal Service (10 minutes and 12 seconds).\n* **Shortest Application:** On the other hand, It took me just 17 seconds to apply to Renaissance Technologies.\n* **ATS Impact:** Older ATS like Workday and Taleo make job applications as much as 128% longer.\n\n**You can view the spreadsheet with the full raw data** [here](https://mailchi.mp/1a15a90c4aeb/company_raw_data_leadmagnet)\n\nLet's dive in.\n\n# The Setup\n\nThere’s no real method to the 250 companies I pick. I’m just typing names into Google and trying to vary it up. Where does Trisha work? What was that billboard I saw? It's all up for grabs.\n\nHere’s the distribution of the 250 companies by size:\n\nhttps://preview.redd.it/gv6r6xoqvyxb1.png?width=2420&amp;format=png&amp;auto=webp&amp;s=6feb536781f5f892ff57aaed0033e716be4c25c4\n\nSome examples of companies in each range:\n\n* 1-500 → Glean, Quizlet, Gumroad\n* 500-5,000 → Notion, Dolby, Moloco\n* 5,000-50,000 → Airbnb, Genentech, Logitech\n* 50,000-100,000 → HP, American Express, Pfizer\n* 100,000+ → Wells Fargo, Lockheed Martin, General Motors\n\nAnd here’s a look at the different types of industries represented:\n\nhttps://preview.redd.it/j1nonh9tvyxb1.png?width=2372&amp;format=png&amp;auto=webp&amp;s=2234a153954270bd3724029dac51cd270bfaf6ba\n\nI used a mix of Linkedin and Crunchbase for categorization.\n\nBefore we get started, if you’d like you can read up on my [methodology](https://docs.google.com/document/d/1A0I9_WBN9zIqwezM6OXqmOl3LPqaq5704EPmGDTDiYI/edit) for applying to each job (aka assumptions I made, what data I chose to submit, and how much effort I put into each application).\n\n***Note***: For more content like this, [*subscribe*](https://www.careerfair.io/subscribe) *to my newsletter. In a couple of weeks, I'll be releasing my guide to writing a killer resume.*\n\n# What makes a job application so frustrating\n\nGenerally speaking, the more frustrating a job application, the longer it takes to complete.\n\nThe three main factors that might influence how long a job application is (as measured in my data):\n\n1. **Company size** → I would expect bigger companies to ask more questions.\n2. **The ATS that is being used** → I would expect clunkier, older ATS to make job applications longer.\n3. **Company industry** → I would expect more “traditional” industries to ask more questions.\n\nWe’re going to model the relationship between the above three factors and the amount of time it takes to complete a job application. To do this, we’re going to use a technique called linear regression.\n\nRegression is about the way two measurements change together. It can help us make predictions.\n\nFor example, if I add 10 employees to a company, how many seconds will that add to the company’s job application process?\n\nSince we have other factors like ATS and Industry, we will also account for those. For now, though, let’s just focus on each factor one by one.\n\n# Company Size\n\nLet’s first plot the data as is:\n\nhttps://preview.redd.it/sdvfivrzvyxb1.png?width=3276&amp;format=png&amp;auto=webp&amp;s=37d9d55db8d0fef37d0365c523a0c1ba7e3e4199\n\nYes, I know, this isn’t the most useful graph. I’m going to spruce it up real quick, I promise.\n\nThe United States Postal Service has a job application that took over 10 minutes to complete. Navigating their portal felt like using Internet Explorer in 2003:\n\nhttps://preview.redd.it/40iu1ni2wyxb1.png?width=1604&amp;format=png&amp;auto=webp&amp;s=b7b65699a39f2e4e3c3abadf38875280a673a0d7\n\nNetflix’s application was just 20 seconds - their only mandatory requirements are your resume and basic info.\n\nhttps://preview.redd.it/sl4fums4wyxb1.png?width=2310&amp;format=png&amp;auto=webp&amp;s=4c0c87299460bd22163f34db1040a56ea3893059\n\nApple took me 71 seconds, still pretty fast for a company that has over 270,000 employees (PWC, which has a similar number of employees, took me almost six times as long).\n\nOkay, back to the chart. There are a couple of problems with it.\n\nFirst, the data is not linear. This is a problem if we want to use linear regression.\n\nSecond, the company size scale is hard to interpret because of the many data points clumped together near zero (representing all the smaller companies).\n\nWe can resolve both these issues with the following insight:\n\nThere is a big difference between going from 10 to 100 employees and, say, 10,000 to 10,100 employees. The first represents major changes in company structure: you might actually hire a proper HR team, a bunch of recruiters, and build out your candidate experience. The second, though, is pretty much just business as usual - think of a multinational opening up a satellite office or a regular month of hiring.\n\nSince we want to account for this, our data is better suited to a log scale than a linear scale. I will also transform our Y-axis, the application time, to a log scale because it helps normalize the data.\n\nIf we plot both our variables on a log-log scale, we get the below chart:\n\nhttps://preview.redd.it/5l4po6d8wyxb1.png?width=4304&amp;format=png&amp;auto=webp&amp;s=b3199197ea1b608fc39b8c3626ab994dc9d5eb5e\n\nBetter right? This is the same data as the last chart, but with different axes that fits the data better, we observe a linear relationship.\n\nWe have the usual suspects in the top right: Government organizations, professional services firms, and some of the tech industry dinosaurs.\n\nThe variance in application times across smaller companies, like startups, is interesting. For example, many of the startups with longer application times (e.g OpenAI, Posthog, Comma.AI) reference that they are looking for “exceptional” candidates on their careers page. (Note that OpenAI has changed its application since I last analyzed it - it’s now much faster, but when I went through they asked for a mini essay on why you’re exceptional).\n\nOne thing that I was expecting to see was competitors mirroring each other’s application times. This is most closely represented with the consulting firms like Deloitte, E&amp;Y, KPMG, etc all clumped together. McKinsey and Bain, the two most prestigious consulting firms, have applications that take longer to complete.\n\nThis doesn’t necessarily seem to be the case with the FAANG companies.\n\nWe can also calculate the correlation coefficient for this graph. This is a statistical measure of the strength of a linear relationship between two variables. The closer to 1 the value, the stronger the relationship.\n\nFor the above data, we get a correlation coefficient of 0.58, which is a moderate to strong association.\n\nNote that on its own, this doesn't tell us anything about causation. But it does start to point us in some type of direction.\n\nIt's not rocket science: big companies ask for more stuff. Sometimes they ask for the last 4 digits of your SSN.\n\nhttps://preview.redd.it/c7g5717bwyxb1.png?width=1512&amp;format=png&amp;auto=webp&amp;s=38c776e46d45d179a6627ba3470fd4f89ca04204\n\nSometimes they even ask if you’d be okay going through a polygraph:\n\nhttps://preview.redd.it/1q52rzldwyxb1.png?width=400&amp;format=png&amp;auto=webp&amp;s=b3b8921e055d38e04ee7395e9b982fa50c38f9df\n\nAn argument here is that if big companies didn’t have some sort of barriers in their application process, they’d get swarmed with applications.\n\nConsider the fact that Google gets 3 million applications every year. Deloitte gets 2 million. Without some sort of initial friction in the application process, those numbers would be even higher. That friction almost serves as a reliable filter for interest.\n\nIf you’re an employer, you don’t really care about the people using a shotgun approach to apply. You want the candidates that have a real interest in the position. On the other hand, if you’re a candidate, the reality is such that the shotgun approach to apply is arguably the most efficient.\n\nSo we have this inherent tension between companies and candidates. Candidates want the most bang for their buck, companies don’t want thousands of irrelevant resumes.\n\nAnd in the middle, we have the plethora of application tracking software that can often be quite old and clunky.\n\n# ATS\n\nEverytime I came face to face with a company that used Workday as their ATS, I died a bit inside. This is because Workday makes you:\n\n1. create a new account every single time\n2. redirects you away from the careers page\n\nI defined a redirect as one when the job description is not listed on the same page as the first input box part of the application.\n\nThis isn’t a perfectly accurate measure, but it does allow us to differentiate between the modern ATS like Greenhouse and older ones like Workday.\n\nWith every ATS, I implicitly had some type of “how easy is this going to be” metric in my head.\n\nWe can try to represent this “how easy is this going to be” metric a bit more concretely using the matrix below.\n\nhttps://preview.redd.it/bvpeu47iwyxb1.png?width=2200&amp;format=png&amp;auto=webp&amp;s=818191eb4a0a5924c582f3ad7ec9539bc510f6fa\n\nIdeally, you want the ATS to be in the bottom left corner. This creates an experience that is low friction and fast.\n\nIf we plot application time versus ATS, this is what we get:\n\nhttps://preview.redd.it/pe9zyxmkwyxb1.png?width=3184&amp;format=png&amp;auto=webp&amp;s=8df5c1118f9f0044e2154c8ae63816332ca42d67\n\nThe ATS that don’t make you create an account and don’t redirect you are tied to lower application times than the ones that do.\n\nOne possibility is that certain companies are more likely to use certain ATS. Big companies might use Workday for better compliance reporting. Same with the industry - maybe B2C software companies use the newer ATS on the market. These would be confounding variables, meaning that we may misinterpret a relationship between the ATS and the application time when in fact there isn’t one (and the real relationship is tied to the industry or size).\n\nSo to properly understand whether the ATS actually has an effect on application time, we need to control for our other variables. We’ll do this in the final section when we run a regression including all our variables.\n\nOne of the big frustrations surrounding different ATS is that when you upload your resume, you then need to retype out your experience in the boxes because the ATS resume parser did it incorrectly. For example, I went to UC Berkeley but sometimes got this:\n\nhttps://preview.redd.it/ay21vccnwyxb1.png?width=928&amp;format=png&amp;auto=webp&amp;s=9862b0860c49c87a76b02218f8e4118134acfb89\n\nThe only resume parser that didn't seem abysmal was the one from Smart Recruiters. TikTok's resume parser also isn't bad.\n\nAnother frustrating experience is tied to inconsistency between the company I'm applying to and the ATS.\n\nhttps://preview.redd.it/9xzq21vpwyxb1.png?width=350&amp;format=png&amp;auto=webp&amp;s=8432b293be4db0f58770760097df0117b53e667e\n\nA company’s application process is often the first touchpoint you have with their brand. Startups competing for the best talent can't afford extra steps in their process. Apple and Facebook can.\n\nWhilst the average time to complete a job application may only be 162 seconds, the fact that many ATS require steps like account creation and authentication can lead to application fatigue.\n\nIt’s not necessarily the explicit amount of time it takes, it’s the steps involved that drain you of energy and make you want to avoid applying to new jobs.\n\n# Industry\n\nOkay, so far we’ve looked at company size and the ATS as a loose indicator of what might make a job application frustrating. What about the company industry?\n\nYou would expect industries like banking or professional services to have longer application times, because getting those jobs revolves around having a bunch of credentials which they likely screen for (and ask you to submit) early on in the process.\n\nOn the other hand, internet startups I’d expect to be quick and fast. Let’s find out if this is true.\n\nhttps://preview.redd.it/i7825ssvwyxb1.png?width=4012&amp;format=png&amp;auto=webp&amp;s=3f51989a663cf7b8c664eacb983a9be0a8dbc80b\n\nHyped up industries like AI and Crypto have shorter application times. As expected, banks and consulting firms care about your GPA and ask you to submit it.\n\nA government company has to basically verify your identity before they can even receive your application, so the process is entirely different and reflected in the submission time.\n\nFor many technology companies, the application process is almost like an extension of the company’s brand itself. For example, Plaid (an API first Fintech company), has a neat option where you can actually apply to the job via API:\n\nhttps://preview.redd.it/px5k5wwxwyxb1.png?width=720&amp;format=png&amp;auto=webp&amp;s=d669e7e47e77e51d48a4867a2d06d27125617ed8\n\nRoblox, a gaming company, allows people to submit job applications from within their [games](https://gamerant.com/roblox-company-interview-job-applicants-in-game/).\n\nWe also notice differences between legacy companies and their newer competitors. If we compare legacy banks versus neobanks (like Monzo, Mercury, etc), the legacy players averaged around 250 seconds per job application whereas the neobanks averaged less than 60 seconds.\n\nIf you can’t compete on prestige, you need to find other ways. One of those ways can be through asking for less information upfront.\n\n# Putting it together\n\nNow that we've analyzed each variable - the company size, ATS, and the industry - to understand the separate relationship of each to application time, we can use linear regression to understand the *combined* relationships.\n\nThis will allow us to determine what factors actually have an impact on the job application time versus which ones might just have had one when we looked at them in isolation.\n\nAfter some number crunching in R, I get the following results (I’ve only added the statistically significant factors – the ones with the “strongest evidence”):\n\nhttps://preview.redd.it/g2pg1o11xyxb1.png?width=2496&amp;format=png&amp;auto=webp&amp;s=2efc92ad2cfa4aaf25297d23c228d0c7343729f9\n\nHere’s how you can interpret some of the information above:\n\n* When a job app is for a company that is within the Government industry, the submission time goes up by 366% (assuming the size and ATS are constant). For the aerospace industry, this is 249% (and so on).\n* When a job app is for a company using the Workday ATS, the submission times goes up by 128% (assuming the size and industry are constant). For the Phenom ATS, this is 110% (and so on).\n* Our only (statistically significant) metric which seems to make job applications faster is the Lever ATS (42% shorter).\n\nOkay, now what about company size?\n\nWell, first up: company size is indeed statistically significant. So there is an effect.\n\nHowever, its effect is not as strong as most of our other variables. To be precise, here are some ways to interpret our company size coefficient:\n\n* If company size doubles, the app size increases by 5%\n* If company size increases by a factor of 10, then the app time increases by 20%\n\nThis is a smaller effect size compared to ATS or industry (a 20% increases in app time for a 10x large company is a qualitatively smaller effect size than e.g. a 100% increase in app time for Taleo ATS). So although company size is statistically significant, it is not as strong of a driver as ATS and industry of app time.\n\n# Wrapping it up\n\nTwo and a half minutes might not be too long, but it can feel like an eternity when you’re forced to answer the same questions and upload the same documents. Over and over again.\n\nThink about catching a flight. All you want is to get on the jet. Hawaii awaits.\n\nBut first: the security line. You have to take your shoes off. You get patted down and your bag gets searched. The gate numbers don’t make sense. And then at the end of it, your flight’s delayed. Congrats.\n\nApplying to a job can feel similar. All you want to do is say aloha to the hiring manager, a real human being.\n\nTo even have the remote possibility of making that happen, you need to create an account and password, check your email, retype your entire resume, tell them the color of your skin, and explain why this company you’ve never heard of before is the greatest thing on Earth.\n\nAnd for what? Most likely for the privilege of receiving an automated email about two weeks later rejecting you.\n\nIf we make it tiring and unappealing to look for new opportunities, then we prevent people from doing their best work.\n\nBut what would a world where applying took just a few seconds actually look like? Recruiters would get bombarded with resumes. It's possible to argue that job applications taking so long is a feature, not a bug. You get to filter for intent and narrow down your application pool.\n\nIs it fair to shift the burden of screening unqualified candidates onto good candidates that now need to provide so much information? Shouldn’t that burden fall on the recruiter?\n\nThe truth is that applying to a job via the careers page is a bit of a rigged game. The odds are not in your favor.\n\nSometimes, though, all you need is to only be right once.\n\n\\*\\*\\*\n\nIf you made it all the way to the bottom, you're a star. This took a while to write. I hope you enjoyed it.\n\nFor more content like this, [subscribe](https://www.careerfair.io/subscribe) to my newsletter. It's my best content delivered to your inbox \\~once a month.\n\nAny questions and I'll be in the comments :)\n\n\\- Shikhar", "author_fullname": "t2_qr5uf", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "I applied to 250 jobs and timed how long each one took", "link_flair_richtext": [], "subreddit_name_prefixed": "r/datascience", "hidden": false, "pwls": 6, "link_flair_css_class": "fun", "downs": 0, "thumbnail_height": 73, "top_awarded_type": null, "hide_score": false, "media_metadata": {"c7g5717bwyxb1": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 53, "x": 108, "u": "https://preview.redd.it/c7g5717bwyxb1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=b92c2ec527b4be8934a2abf28dec67d30144710b"}, {"y": 107, "x": 216, "u": "https://preview.redd.it/c7g5717bwyxb1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=47511b53f3251206f50d4a4f5dfddc6bc853ebe3"}, {"y": 159, "x": 320, "u": "https://preview.redd.it/c7g5717bwyxb1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=c270dd66e42bd4f3682fdcf8ea1140042d57a4b3"}, {"y": 318, "x": 640, "u": "https://preview.redd.it/c7g5717bwyxb1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=b91b2cfc0d9dfb17cb084ee0f3f2ca7e176ecc66"}, {"y": 477, "x": 960, "u": "https://preview.redd.it/c7g5717bwyxb1.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=bcac018e0eb49b295df0a6b1eca68cd92d34d014"}, {"y": 537, "x": 1080, "u": "https://preview.redd.it/c7g5717bwyxb1.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=4a70b80fffe3c2ab79275cf6a1afc327f7602f9d"}], "s": {"y": 752, "x": 1512, "u": "https://preview.redd.it/c7g5717bwyxb1.png?width=1512&amp;format=png&amp;auto=webp&amp;s=38c776e46d45d179a6627ba3470fd4f89ca04204"}, "id": "c7g5717bwyxb1"}, "5l4po6d8wyxb1": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 67, "x": 108, "u": "https://preview.redd.it/5l4po6d8wyxb1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=e0abfde8c3e42fc920454b3bc579cf32d4671825"}, {"y": 135, "x": 216, "u": "https://preview.redd.it/5l4po6d8wyxb1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=a26e15b47d77feda6c9137b3f5fc381b4b2d34fe"}, {"y": 200, "x": 320, "u": "https://preview.redd.it/5l4po6d8wyxb1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=14fcdc054da260f6c82c6c29e6a16e1c3b540931"}, {"y": 400, "x": 640, "u": "https://preview.redd.it/5l4po6d8wyxb1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=8adf7bbb7eb97a26197964ac9a0f1045c7310293"}, {"y": 601, "x": 960, "u": "https://preview.redd.it/5l4po6d8wyxb1.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=3b54dfc53974efb6deca7046a7bd673635f06b95"}, {"y": 676, "x": 1080, "u": "https://preview.redd.it/5l4po6d8wyxb1.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=01844d3d5fec435f95edb3b59dc4a89f7518a721"}], "s": {"y": 2696, "x": 4304, "u": "https://preview.redd.it/5l4po6d8wyxb1.png?width=4304&amp;format=png&amp;auto=webp&amp;s=b3199197ea1b608fc39b8c3626ab994dc9d5eb5e"}, "id": "5l4po6d8wyxb1"}, "g2pg1o11xyxb1": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 71, "x": 108, "u": "https://preview.redd.it/g2pg1o11xyxb1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=5d02b172e56c86dc84d86a5fe11485089906b861"}, {"y": 142, "x": 216, "u": "https://preview.redd.it/g2pg1o11xyxb1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=ceea5b6943309fd3d2e0eb078560ddde8a909d80"}, {"y": 211, "x": 320, "u": "https://preview.redd.it/g2pg1o11xyxb1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=82824414d7921519d3cd8bb3ce144cf0f64eb5de"}, {"y": 423, "x": 640, "u": "https://preview.redd.it/g2pg1o11xyxb1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=40d67529fd36aebb85f34df84b795e5dc3172acb"}, {"y": 635, "x": 960, "u": "https://preview.redd.it/g2pg1o11xyxb1.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=a2b0b852fdf0637381b9e4b96b4cf1a90aaae2b9"}, {"y": 714, "x": 1080, "u": "https://preview.redd.it/g2pg1o11xyxb1.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=f78fdbfcac0bc906597c4d49010b1d525507fb3f"}], "s": {"y": 1652, "x": 2496, "u": "https://preview.redd.it/g2pg1o11xyxb1.png?width=2496&amp;format=png&amp;auto=webp&amp;s=2efc92ad2cfa4aaf25297d23c228d0c7343729f9"}, "id": "g2pg1o11xyxb1"}, "40iu1ni2wyxb1": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 85, "x": 108, "u": "https://preview.redd.it/40iu1ni2wyxb1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=8839807ad94e17cf83e9723ff662eeceadf60752"}, {"y": 171, "x": 216, "u": "https://preview.redd.it/40iu1ni2wyxb1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=78bc3ab2ec92a769bb5ff08dad25a56b3163bb8a"}, {"y": 253, "x": 320, "u": "https://preview.redd.it/40iu1ni2wyxb1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=24b024402afb7f5b3c3c320b33b3482352cbb5dd"}, {"y": 506, "x": 640, "u": "https://preview.redd.it/40iu1ni2wyxb1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=5a3f0d4bcc0edbb9fa50071b08834281a323f9d8"}, {"y": 760, "x": 960, "u": "https://preview.redd.it/40iu1ni2wyxb1.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=8859e74bb34649bd7a2c5d4711d39c817f082cce"}, {"y": 855, "x": 1080, "u": "https://preview.redd.it/40iu1ni2wyxb1.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=25c35ac06e9e2dd1457a4f212fa83e5ef9e5479e"}], "s": {"y": 1270, "x": 1604, "u": "https://preview.redd.it/40iu1ni2wyxb1.png?width=1604&amp;format=png&amp;auto=webp&amp;s=b7b65699a39f2e4e3c3abadf38875280a673a0d7"}, "id": "40iu1ni2wyxb1"}, "j1nonh9tvyxb1": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 67, "x": 108, "u": "https://preview.redd.it/j1nonh9tvyxb1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=ca713a1dcb4d8cb308156237bb492e8aaa95e892"}, {"y": 134, "x": 216, "u": "https://preview.redd.it/j1nonh9tvyxb1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=8eb53cef4fb00b23328d22905a163f7ec3ab07eb"}, {"y": 199, "x": 320, "u": "https://preview.redd.it/j1nonh9tvyxb1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=742debda879a1266109377abe4713a70b60cce45"}, {"y": 399, "x": 640, "u": "https://preview.redd.it/j1nonh9tvyxb1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=089620a5ff9ca22e59377a56d58e34426fbe03af"}, {"y": 598, "x": 960, "u": "https://preview.redd.it/j1nonh9tvyxb1.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=e46746e2101c1b3ce4c5ad5d7f03d63fc358192c"}, {"y": 673, "x": 1080, "u": "https://preview.redd.it/j1nonh9tvyxb1.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=2af732f873655bbc03ebc27d45e59ae4fd56ffb4"}], "s": {"y": 1480, "x": 2372, "u": "https://preview.redd.it/j1nonh9tvyxb1.png?width=2372&amp;format=png&amp;auto=webp&amp;s=2234a153954270bd3724029dac51cd270bfaf6ba"}, "id": "j1nonh9tvyxb1"}, "px5k5wwxwyxb1": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 82, "x": 108, "u": "https://preview.redd.it/px5k5wwxwyxb1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=6c62d25f6fd096692e181ca01e6c607bcf6ce564"}, {"y": 165, "x": 216, "u": "https://preview.redd.it/px5k5wwxwyxb1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=e85318b8a131184309d6783665611bc7c4fb3c01"}, {"y": 245, "x": 320, "u": "https://preview.redd.it/px5k5wwxwyxb1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=2b2e2c8d456695d1566b8e0fd0afccc4aca07260"}, {"y": 490, "x": 640, "u": "https://preview.redd.it/px5k5wwxwyxb1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=a8fc200c8f87f5a7a7292c14cce5809bc2ac5e5b"}], "s": {"y": 552, "x": 720, "u": "https://preview.redd.it/px5k5wwxwyxb1.png?width=720&amp;format=png&amp;auto=webp&amp;s=d669e7e47e77e51d48a4867a2d06d27125617ed8"}, "id": "px5k5wwxwyxb1"}, "gv6r6xoqvyxb1": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 66, "x": 108, "u": "https://preview.redd.it/gv6r6xoqvyxb1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=cb785e185142f420e24182a1154cf3b4f8dee239"}, {"y": 133, "x": 216, "u": "https://preview.redd.it/gv6r6xoqvyxb1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=5afcfcde41a75088bd7c1c0501dec1c40464b4a6"}, {"y": 198, "x": 320, "u": "https://preview.redd.it/gv6r6xoqvyxb1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=335a19bfd08fe9aa242a6bf952a9243c47963add"}, {"y": 396, "x": 640, "u": "https://preview.redd.it/gv6r6xoqvyxb1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=7e12f0a4da1a8c333126d5aca8a2710b2dbfc242"}, {"y": 595, "x": 960, "u": "https://preview.redd.it/gv6r6xoqvyxb1.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=595c26ac3baca41998a80ae568b14f0394402b04"}, {"y": 669, "x": 1080, "u": "https://preview.redd.it/gv6r6xoqvyxb1.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=40c6307bc688311ebb9e67e92955a4e2b4918948"}], "s": {"y": 1500, "x": 2420, "u": "https://preview.redd.it/gv6r6xoqvyxb1.png?width=2420&amp;format=png&amp;auto=webp&amp;s=6feb536781f5f892ff57aaed0033e716be4c25c4"}, "id": "gv6r6xoqvyxb1"}, "pe9zyxmkwyxb1": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 69, "x": 108, "u": "https://preview.redd.it/pe9zyxmkwyxb1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=bbc0051612fd9a633a918aed1da3c3392313937d"}, {"y": 139, "x": 216, "u": "https://preview.redd.it/pe9zyxmkwyxb1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=435afe2fe2cde6d4f8df37817a37cd210a66430f"}, {"y": 207, "x": 320, "u": "https://preview.redd.it/pe9zyxmkwyxb1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=3ce2c3f43bea6739452baf9a5264f22282464ce9"}, {"y": 414, "x": 640, "u": "https://preview.redd.it/pe9zyxmkwyxb1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=6ba4fee50775e9d1f5b49d4d24a3f8bbbba3085e"}, {"y": 621, "x": 960, "u": "https://preview.redd.it/pe9zyxmkwyxb1.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=0589c87dac8d554ced93a6fd1071d9ef8fbfe4d5"}, {"y": 698, "x": 1080, "u": "https://preview.redd.it/pe9zyxmkwyxb1.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=de07e26e0c5b9398004535e068335076fef5d492"}], "s": {"y": 2060, "x": 3184, "u": "https://preview.redd.it/pe9zyxmkwyxb1.png?width=3184&amp;format=png&amp;auto=webp&amp;s=8df5c1118f9f0044e2154c8ae63816332ca42d67"}, "id": "pe9zyxmkwyxb1"}, "bvpeu47iwyxb1": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 87, "x": 108, "u": "https://preview.redd.it/bvpeu47iwyxb1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=4bc25a90422878a74cbcc020b168b57f9ff5c5d2"}, {"y": 175, "x": 216, "u": "https://preview.redd.it/bvpeu47iwyxb1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=a301e2f07826433afffe45f9a571ff43f6fbf8f4"}, {"y": 259, "x": 320, "u": "https://preview.redd.it/bvpeu47iwyxb1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=12fa039eedfc6755adc172a8daa0561be183cbad"}, {"y": 518, "x": 640, "u": "https://preview.redd.it/bvpeu47iwyxb1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=7a53112c44ac9d286f6ff850086936d8934a6380"}, {"y": 778, "x": 960, "u": "https://preview.redd.it/bvpeu47iwyxb1.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=d62eac8af16368c1c122b1684d2239fc99304765"}, {"y": 875, "x": 1080, "u": "https://preview.redd.it/bvpeu47iwyxb1.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=220c3349715296d3a4ce9db2511267518bc12234"}], "s": {"y": 1784, "x": 2200, "u": "https://preview.redd.it/bvpeu47iwyxb1.png?width=2200&amp;format=png&amp;auto=webp&amp;s=818191eb4a0a5924c582f3ad7ec9539bc510f6fa"}, "id": "bvpeu47iwyxb1"}, "adj6ge9jvyxb1": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 49, "x": 108, "u": "https://preview.redd.it/adj6ge9jvyxb1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=b0efa564522076e00cf3b8286be56bcc2ec0b571"}, {"y": 99, "x": 216, "u": "https://preview.redd.it/adj6ge9jvyxb1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=dd5b2f41768bda4fb1dea0acaa468a7cb08d16c3"}, {"y": 147, "x": 320, "u": "https://preview.redd.it/adj6ge9jvyxb1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=64fca4e187d6732b335c5f1c6f5e83dd96372b5b"}, {"y": 295, "x": 640, "u": "https://preview.redd.it/adj6ge9jvyxb1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=877a7e456e85cfc27c5fa78895fb994fc91ae684"}, {"y": 443, "x": 960, "u": "https://preview.redd.it/adj6ge9jvyxb1.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=bd945fed5363f1963fb90645286f68f9ef8c9b45"}, {"y": 499, "x": 1080, "u": "https://preview.redd.it/adj6ge9jvyxb1.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=523e7baaac9d1272c30be193e3ca21be2d4dcd94"}], "s": {"y": 1304, "x": 2820, "u": "https://preview.redd.it/adj6ge9jvyxb1.png?width=2820&amp;format=png&amp;auto=webp&amp;s=2123533d9d04aabcdd5988471274ee2ed3b98704"}, "id": "adj6ge9jvyxb1"}, "ay21vccnwyxb1": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 50, "x": 108, "u": "https://preview.redd.it/ay21vccnwyxb1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=8b773d6197f1963bb658c73efac82120a0fc18a8"}, {"y": 101, "x": 216, "u": "https://preview.redd.it/ay21vccnwyxb1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=29673d4595b283b4899c1829e7cea4a59bf5fb0e"}, {"y": 150, "x": 320, "u": "https://preview.redd.it/ay21vccnwyxb1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=8e9c7f025855eaffcfd739d8cada45eb0e103d3a"}, {"y": 300, "x": 640, "u": "https://preview.redd.it/ay21vccnwyxb1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=f3747a1e6e11027c16b4e7b9fafdee2039e2e284"}], "s": {"y": 436, "x": 928, "u": "https://preview.redd.it/ay21vccnwyxb1.png?width=928&amp;format=png&amp;auto=webp&amp;s=9862b0860c49c87a76b02218f8e4118134acfb89"}, "id": "ay21vccnwyxb1"}, "sl4fums4wyxb1": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 40, "x": 108, "u": "https://preview.redd.it/sl4fums4wyxb1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=f958f74c127f044f82981a378e790c49e11a15b1"}, {"y": 80, "x": 216, "u": "https://preview.redd.it/sl4fums4wyxb1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=fadbb448dca93b396507f9ce2b47724b56c3801f"}, {"y": 118, "x": 320, "u": "https://preview.redd.it/sl4fums4wyxb1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=250aa7bdb6f76fa38ad2cac5fe9cb446febed9f5"}, {"y": 237, "x": 640, "u": "https://preview.redd.it/sl4fums4wyxb1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=ad8b627073b52f90cba3e6455ef8b7baf0ba6c5d"}, {"y": 355, "x": 960, "u": "https://preview.redd.it/sl4fums4wyxb1.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=e4e02b1d004d1d1cfeff13ee13e10b5ff7af6836"}, {"y": 400, "x": 1080, "u": "https://preview.redd.it/sl4fums4wyxb1.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=25813604cf6b6c0aceab7ef63d9c3901b625c713"}], "s": {"y": 856, "x": 2310, "u": "https://preview.redd.it/sl4fums4wyxb1.png?width=2310&amp;format=png&amp;auto=webp&amp;s=4c0c87299460bd22163f34db1040a56ea3893059"}, "id": "sl4fums4wyxb1"}, "sdvfivrzvyxb1": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 74, "x": 108, "u": "https://preview.redd.it/sdvfivrzvyxb1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=6e99f98711f8d0213491f0b7917727927a41f3dd"}, {"y": 149, "x": 216, "u": "https://preview.redd.it/sdvfivrzvyxb1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=0353a031cebdff717c2e8be05e39eac20e5f462d"}, {"y": 221, "x": 320, "u": "https://preview.redd.it/sdvfivrzvyxb1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=e6a4d49b31960618f9521739aa0befb7552b40bb"}, {"y": 442, "x": 640, "u": "https://preview.redd.it/sdvfivrzvyxb1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=7fbff5e1cfa740f1f5ee06d71fde718f103c31c7"}, {"y": 663, "x": 960, "u": "https://preview.redd.it/sdvfivrzvyxb1.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=18896af7fcd97e02fbbd762c895a494d1aaeaf04"}, {"y": 746, "x": 1080, "u": "https://preview.redd.it/sdvfivrzvyxb1.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=a8b001c30268c1091913a0faf2270087f5d9c7c2"}], "s": {"y": 2264, "x": 3276, "u": "https://preview.redd.it/sdvfivrzvyxb1.png?width=3276&amp;format=png&amp;auto=webp&amp;s=37d9d55db8d0fef37d0365c523a0c1ba7e3e4199"}, "id": "sdvfivrzvyxb1"}, "9xzq21vpwyxb1": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 181, "x": 108, "u": "https://preview.redd.it/9xzq21vpwyxb1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=341e11e8732f0bd3a511b80a76ea22b9ebf905e9"}, {"y": 362, "x": 216, "u": "https://preview.redd.it/9xzq21vpwyxb1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=57e0396ef0a66e8e9904a68da30c7395ca3311b4"}, {"y": 537, "x": 320, "u": "https://preview.redd.it/9xzq21vpwyxb1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=e9c5f08fd0072b458dbc360dd012df812ab391f4"}], "s": {"y": 588, "x": 350, "u": "https://preview.redd.it/9xzq21vpwyxb1.png?width=350&amp;format=png&amp;auto=webp&amp;s=8432b293be4db0f58770760097df0117b53e667e"}, "id": "9xzq21vpwyxb1"}, "1q52rzldwyxb1": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 51, "x": 108, "u": "https://preview.redd.it/1q52rzldwyxb1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=a65840b25ab96a16aa124a8a7cecfc1287e8415b"}, {"y": 102, "x": 216, "u": "https://preview.redd.it/1q52rzldwyxb1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=71b38384688ee4eaaca3f52912b519748bdfcf15"}, {"y": 152, "x": 320, "u": "https://preview.redd.it/1q52rzldwyxb1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=6f997dac69a8fbfef9d5147cc12792ec3d4cc8b1"}], "s": {"y": 190, "x": 400, "u": "https://preview.redd.it/1q52rzldwyxb1.png?width=400&amp;format=png&amp;auto=webp&amp;s=b3b8921e055d38e04ee7395e9b982fa50c38f9df"}, "id": "1q52rzldwyxb1"}, "ttn8yd1mvyxb1": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 39, "x": 108, "u": "https://preview.redd.it/ttn8yd1mvyxb1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=0d606044fd8fd3f5313908ad1194428567f7a447"}, {"y": 78, "x": 216, "u": "https://preview.redd.it/ttn8yd1mvyxb1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=9d9834f6d8473f662884ce31cf6d4da5010567ab"}, {"y": 116, "x": 320, "u": "https://preview.redd.it/ttn8yd1mvyxb1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=73ca2373c238d7581ee885bde0ad37efb9f90c1d"}, {"y": 233, "x": 640, "u": "https://preview.redd.it/ttn8yd1mvyxb1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=f1152053a37cc6a5ec6520e96d349a4835561959"}, {"y": 350, "x": 960, "u": "https://preview.redd.it/ttn8yd1mvyxb1.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=b010e1d6a8d762620d47a5519ae5476291560f16"}, {"y": 394, "x": 1080, "u": "https://preview.redd.it/ttn8yd1mvyxb1.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=5381f2b4d79f7925d40918417085432aa2a2a542"}], "s": {"y": 828, "x": 2266, "u": "https://preview.redd.it/ttn8yd1mvyxb1.png?width=2266&amp;format=png&amp;auto=webp&amp;s=f27a52217e85bfade6eb30f0b696914eac7fc270"}, "id": "ttn8yd1mvyxb1"}, "i7825ssvwyxb1": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 67, "x": 108, "u": "https://preview.redd.it/i7825ssvwyxb1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=be4e90d2d209b57cabf10f06bb326c50d2895e62"}, {"y": 135, "x": 216, "u": "https://preview.redd.it/i7825ssvwyxb1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=0c4a73bca8cdbb17f979fe8065d13e558703fe27"}, {"y": 201, "x": 320, "u": "https://preview.redd.it/i7825ssvwyxb1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=bf952eff6478440a288d061cb19680a7ebafe0dc"}, {"y": 402, "x": 640, "u": "https://preview.redd.it/i7825ssvwyxb1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=1ac4f3d9455c5d4c4f8afdeeb0284fb139ab7250"}, {"y": 603, "x": 960, "u": "https://preview.redd.it/i7825ssvwyxb1.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=aa2ef133feada830c8148ffa3995ded1c8b13dff"}, {"y": 679, "x": 1080, "u": "https://preview.redd.it/i7825ssvwyxb1.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=45cf02d7275a328e28a3ec7b35ccbfde4e825555"}], "s": {"y": 2524, "x": 4012, "u": "https://preview.redd.it/i7825ssvwyxb1.png?width=4012&amp;format=png&amp;auto=webp&amp;s=3f51989a663cf7b8c664eacb983a9be0a8dbc80b"}, "id": "i7825ssvwyxb1"}}, "name": "t3_17m8la5", "quarantine": false, "link_flair_text_color": "dark", "upvote_ratio": 0.97, "author_flair_background_color": null, "ups": 541, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": 140, "author_flair_template_id": null, "is_original_content": true, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Career Discussion", "can_mod_post": false, "score": 541, "approved_by": null, "is_created_from_ads_ui": false, "author_premium": false, "thumbnail": "https://b.thumbs.redditmedia.com/DNt0RpQ1RH_umIcC7JCNL51A7JoV_yrQGnF72uaryvA.jpg", "edited": 1698965355.0, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "post_hint": "self", "content_categories": null, "is_self": true, "subreddit_type": "public", "created": 1698945535.0, "link_flair_type": "text", "wls": 6, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.datascience", "allow_live_comments": false, "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Applying to jobs online is like navigating a maze.&lt;/p&gt;\n\n&lt;p&gt;Amidst the special torture that is resume parsing software, the inability to reuse information across different application tracking systems (ATS), and the existence of a certain company that rhymes with every day of the week, it can get pretty frustrating.&lt;/p&gt;\n\n&lt;p&gt;I wanted to explore what factors make a job application more or less frustrating.&lt;/p&gt;\n\n&lt;p&gt;For example, what industries have the worst application processes? Do big companies ask for more information than small companies? What is it about websites like Workday that make them really hard to use?&lt;/p&gt;\n\n&lt;p&gt;To answer these questions, I applied to 250 jobs. One by one. Click by click. No Linkedin Easy Apply, no shortcuts – just straight from the careers page.&lt;/p&gt;\n\n&lt;p&gt;I timed how long it took me to go from “apply to job” to “submit application”.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/adj6ge9jvyxb1.png?width=2820&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=2123533d9d04aabcdd5988471274ee2ed3b98704\"&gt;https://preview.redd.it/adj6ge9jvyxb1.png?width=2820&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=2123533d9d04aabcdd5988471274ee2ed3b98704&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Make no mistake: I sacrificed my soul for this post. I created over 83 accounts and spent a total of 11 hours scrolling. I was originally going to do this for 500 companies, but wanted to chop my head off halfway.&lt;/p&gt;\n\n&lt;p&gt;I did this for a mix of companies – Fortune 500 to early stage startups, spread out across different industries from software to manufacturing. The &lt;em&gt;type&lt;/em&gt; of role I applied to was kept constant: engineering / product focused.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/ttn8yd1mvyxb1.png?width=2266&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=f27a52217e85bfade6eb30f0b696914eac7fc270\"&gt;https://preview.redd.it/ttn8yd1mvyxb1.png?width=2266&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=f27a52217e85bfade6eb30f0b696914eac7fc270&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The outcome? An average of over two and a half minutes per application—162 seconds of your life you&amp;#39;ll never get back. But as we dig deeper, you&amp;#39;ll discover that these 162 seconds only scratch the surface of an often maddening process.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Key Takeaways&lt;/em&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Average Application Time:&lt;/strong&gt; On average, it took a bit over two and a half minutes to apply to a job.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Company Size Impact:&lt;/strong&gt; If company size doubles, the application time increases by 5%. If company size increases by a factor of 10, then the app time increases by 20%.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Industry Influence:&lt;/strong&gt; Being a government company is the single largest determinant of a long application, followed closely by aerospace and consulting firms.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Longest Application:&lt;/strong&gt; The longest application time went to the United States Postal Service (10 minutes and 12 seconds).&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Shortest Application:&lt;/strong&gt; On the other hand, It took me just 17 seconds to apply to Renaissance Technologies.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;ATS Impact:&lt;/strong&gt; Older ATS like Workday and Taleo make job applications as much as 128% longer.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;You can view the spreadsheet with the full raw data&lt;/strong&gt; &lt;a href=\"https://mailchi.mp/1a15a90c4aeb/company_raw_data_leadmagnet\"&gt;here&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s dive in.&lt;/p&gt;\n\n&lt;h1&gt;The Setup&lt;/h1&gt;\n\n&lt;p&gt;There’s no real method to the 250 companies I pick. I’m just typing names into Google and trying to vary it up. Where does Trisha work? What was that billboard I saw? It&amp;#39;s all up for grabs.&lt;/p&gt;\n\n&lt;p&gt;Here’s the distribution of the 250 companies by size:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/gv6r6xoqvyxb1.png?width=2420&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=6feb536781f5f892ff57aaed0033e716be4c25c4\"&gt;https://preview.redd.it/gv6r6xoqvyxb1.png?width=2420&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=6feb536781f5f892ff57aaed0033e716be4c25c4&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Some examples of companies in each range:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;1-500 → Glean, Quizlet, Gumroad&lt;/li&gt;\n&lt;li&gt;500-5,000 → Notion, Dolby, Moloco&lt;/li&gt;\n&lt;li&gt;5,000-50,000 → Airbnb, Genentech, Logitech&lt;/li&gt;\n&lt;li&gt;50,000-100,000 → HP, American Express, Pfizer&lt;/li&gt;\n&lt;li&gt;100,000+ → Wells Fargo, Lockheed Martin, General Motors&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;And here’s a look at the different types of industries represented:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/j1nonh9tvyxb1.png?width=2372&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=2234a153954270bd3724029dac51cd270bfaf6ba\"&gt;https://preview.redd.it/j1nonh9tvyxb1.png?width=2372&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=2234a153954270bd3724029dac51cd270bfaf6ba&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I used a mix of Linkedin and Crunchbase for categorization.&lt;/p&gt;\n\n&lt;p&gt;Before we get started, if you’d like you can read up on my &lt;a href=\"https://docs.google.com/document/d/1A0I9_WBN9zIqwezM6OXqmOl3LPqaq5704EPmGDTDiYI/edit\"&gt;methodology&lt;/a&gt; for applying to each job (aka assumptions I made, what data I chose to submit, and how much effort I put into each application).&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Note&lt;/em&gt;&lt;/strong&gt;: For more content like this, &lt;a href=\"https://www.careerfair.io/subscribe\"&gt;&lt;em&gt;subscribe&lt;/em&gt;&lt;/a&gt; &lt;em&gt;to my newsletter. In a couple of weeks, I&amp;#39;ll be releasing my guide to writing a killer resume.&lt;/em&gt;&lt;/p&gt;\n\n&lt;h1&gt;What makes a job application so frustrating&lt;/h1&gt;\n\n&lt;p&gt;Generally speaking, the more frustrating a job application, the longer it takes to complete.&lt;/p&gt;\n\n&lt;p&gt;The three main factors that might influence how long a job application is (as measured in my data):&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;Company size&lt;/strong&gt; → I would expect bigger companies to ask more questions.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;The ATS that is being used&lt;/strong&gt; → I would expect clunkier, older ATS to make job applications longer.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Company industry&lt;/strong&gt; → I would expect more “traditional” industries to ask more questions.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;We’re going to model the relationship between the above three factors and the amount of time it takes to complete a job application. To do this, we’re going to use a technique called linear regression.&lt;/p&gt;\n\n&lt;p&gt;Regression is about the way two measurements change together. It can help us make predictions.&lt;/p&gt;\n\n&lt;p&gt;For example, if I add 10 employees to a company, how many seconds will that add to the company’s job application process?&lt;/p&gt;\n\n&lt;p&gt;Since we have other factors like ATS and Industry, we will also account for those. For now, though, let’s just focus on each factor one by one.&lt;/p&gt;\n\n&lt;h1&gt;Company Size&lt;/h1&gt;\n\n&lt;p&gt;Let’s first plot the data as is:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/sdvfivrzvyxb1.png?width=3276&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=37d9d55db8d0fef37d0365c523a0c1ba7e3e4199\"&gt;https://preview.redd.it/sdvfivrzvyxb1.png?width=3276&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=37d9d55db8d0fef37d0365c523a0c1ba7e3e4199&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Yes, I know, this isn’t the most useful graph. I’m going to spruce it up real quick, I promise.&lt;/p&gt;\n\n&lt;p&gt;The United States Postal Service has a job application that took over 10 minutes to complete. Navigating their portal felt like using Internet Explorer in 2003:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/40iu1ni2wyxb1.png?width=1604&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=b7b65699a39f2e4e3c3abadf38875280a673a0d7\"&gt;https://preview.redd.it/40iu1ni2wyxb1.png?width=1604&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=b7b65699a39f2e4e3c3abadf38875280a673a0d7&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Netflix’s application was just 20 seconds - their only mandatory requirements are your resume and basic info.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/sl4fums4wyxb1.png?width=2310&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=4c0c87299460bd22163f34db1040a56ea3893059\"&gt;https://preview.redd.it/sl4fums4wyxb1.png?width=2310&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=4c0c87299460bd22163f34db1040a56ea3893059&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Apple took me 71 seconds, still pretty fast for a company that has over 270,000 employees (PWC, which has a similar number of employees, took me almost six times as long).&lt;/p&gt;\n\n&lt;p&gt;Okay, back to the chart. There are a couple of problems with it.&lt;/p&gt;\n\n&lt;p&gt;First, the data is not linear. This is a problem if we want to use linear regression.&lt;/p&gt;\n\n&lt;p&gt;Second, the company size scale is hard to interpret because of the many data points clumped together near zero (representing all the smaller companies).&lt;/p&gt;\n\n&lt;p&gt;We can resolve both these issues with the following insight:&lt;/p&gt;\n\n&lt;p&gt;There is a big difference between going from 10 to 100 employees and, say, 10,000 to 10,100 employees. The first represents major changes in company structure: you might actually hire a proper HR team, a bunch of recruiters, and build out your candidate experience. The second, though, is pretty much just business as usual - think of a multinational opening up a satellite office or a regular month of hiring.&lt;/p&gt;\n\n&lt;p&gt;Since we want to account for this, our data is better suited to a log scale than a linear scale. I will also transform our Y-axis, the application time, to a log scale because it helps normalize the data.&lt;/p&gt;\n\n&lt;p&gt;If we plot both our variables on a log-log scale, we get the below chart:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/5l4po6d8wyxb1.png?width=4304&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=b3199197ea1b608fc39b8c3626ab994dc9d5eb5e\"&gt;https://preview.redd.it/5l4po6d8wyxb1.png?width=4304&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=b3199197ea1b608fc39b8c3626ab994dc9d5eb5e&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Better right? This is the same data as the last chart, but with different axes that fits the data better, we observe a linear relationship.&lt;/p&gt;\n\n&lt;p&gt;We have the usual suspects in the top right: Government organizations, professional services firms, and some of the tech industry dinosaurs.&lt;/p&gt;\n\n&lt;p&gt;The variance in application times across smaller companies, like startups, is interesting. For example, many of the startups with longer application times (e.g OpenAI, Posthog, Comma.AI) reference that they are looking for “exceptional” candidates on their careers page. (Note that OpenAI has changed its application since I last analyzed it - it’s now much faster, but when I went through they asked for a mini essay on why you’re exceptional).&lt;/p&gt;\n\n&lt;p&gt;One thing that I was expecting to see was competitors mirroring each other’s application times. This is most closely represented with the consulting firms like Deloitte, E&amp;amp;Y, KPMG, etc all clumped together. McKinsey and Bain, the two most prestigious consulting firms, have applications that take longer to complete.&lt;/p&gt;\n\n&lt;p&gt;This doesn’t necessarily seem to be the case with the FAANG companies.&lt;/p&gt;\n\n&lt;p&gt;We can also calculate the correlation coefficient for this graph. This is a statistical measure of the strength of a linear relationship between two variables. The closer to 1 the value, the stronger the relationship.&lt;/p&gt;\n\n&lt;p&gt;For the above data, we get a correlation coefficient of 0.58, which is a moderate to strong association.&lt;/p&gt;\n\n&lt;p&gt;Note that on its own, this doesn&amp;#39;t tell us anything about causation. But it does start to point us in some type of direction.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not rocket science: big companies ask for more stuff. Sometimes they ask for the last 4 digits of your SSN.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/c7g5717bwyxb1.png?width=1512&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=38c776e46d45d179a6627ba3470fd4f89ca04204\"&gt;https://preview.redd.it/c7g5717bwyxb1.png?width=1512&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=38c776e46d45d179a6627ba3470fd4f89ca04204&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Sometimes they even ask if you’d be okay going through a polygraph:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/1q52rzldwyxb1.png?width=400&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=b3b8921e055d38e04ee7395e9b982fa50c38f9df\"&gt;https://preview.redd.it/1q52rzldwyxb1.png?width=400&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=b3b8921e055d38e04ee7395e9b982fa50c38f9df&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;An argument here is that if big companies didn’t have some sort of barriers in their application process, they’d get swarmed with applications.&lt;/p&gt;\n\n&lt;p&gt;Consider the fact that Google gets 3 million applications every year. Deloitte gets 2 million. Without some sort of initial friction in the application process, those numbers would be even higher. That friction almost serves as a reliable filter for interest.&lt;/p&gt;\n\n&lt;p&gt;If you’re an employer, you don’t really care about the people using a shotgun approach to apply. You want the candidates that have a real interest in the position. On the other hand, if you’re a candidate, the reality is such that the shotgun approach to apply is arguably the most efficient.&lt;/p&gt;\n\n&lt;p&gt;So we have this inherent tension between companies and candidates. Candidates want the most bang for their buck, companies don’t want thousands of irrelevant resumes.&lt;/p&gt;\n\n&lt;p&gt;And in the middle, we have the plethora of application tracking software that can often be quite old and clunky.&lt;/p&gt;\n\n&lt;h1&gt;ATS&lt;/h1&gt;\n\n&lt;p&gt;Everytime I came face to face with a company that used Workday as their ATS, I died a bit inside. This is because Workday makes you:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;create a new account every single time&lt;/li&gt;\n&lt;li&gt;redirects you away from the careers page&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;I defined a redirect as one when the job description is not listed on the same page as the first input box part of the application.&lt;/p&gt;\n\n&lt;p&gt;This isn’t a perfectly accurate measure, but it does allow us to differentiate between the modern ATS like Greenhouse and older ones like Workday.&lt;/p&gt;\n\n&lt;p&gt;With every ATS, I implicitly had some type of “how easy is this going to be” metric in my head.&lt;/p&gt;\n\n&lt;p&gt;We can try to represent this “how easy is this going to be” metric a bit more concretely using the matrix below.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/bvpeu47iwyxb1.png?width=2200&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=818191eb4a0a5924c582f3ad7ec9539bc510f6fa\"&gt;https://preview.redd.it/bvpeu47iwyxb1.png?width=2200&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=818191eb4a0a5924c582f3ad7ec9539bc510f6fa&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Ideally, you want the ATS to be in the bottom left corner. This creates an experience that is low friction and fast.&lt;/p&gt;\n\n&lt;p&gt;If we plot application time versus ATS, this is what we get:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/pe9zyxmkwyxb1.png?width=3184&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=8df5c1118f9f0044e2154c8ae63816332ca42d67\"&gt;https://preview.redd.it/pe9zyxmkwyxb1.png?width=3184&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=8df5c1118f9f0044e2154c8ae63816332ca42d67&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The ATS that don’t make you create an account and don’t redirect you are tied to lower application times than the ones that do.&lt;/p&gt;\n\n&lt;p&gt;One possibility is that certain companies are more likely to use certain ATS. Big companies might use Workday for better compliance reporting. Same with the industry - maybe B2C software companies use the newer ATS on the market. These would be confounding variables, meaning that we may misinterpret a relationship between the ATS and the application time when in fact there isn’t one (and the real relationship is tied to the industry or size).&lt;/p&gt;\n\n&lt;p&gt;So to properly understand whether the ATS actually has an effect on application time, we need to control for our other variables. We’ll do this in the final section when we run a regression including all our variables.&lt;/p&gt;\n\n&lt;p&gt;One of the big frustrations surrounding different ATS is that when you upload your resume, you then need to retype out your experience in the boxes because the ATS resume parser did it incorrectly. For example, I went to UC Berkeley but sometimes got this:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/ay21vccnwyxb1.png?width=928&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=9862b0860c49c87a76b02218f8e4118134acfb89\"&gt;https://preview.redd.it/ay21vccnwyxb1.png?width=928&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=9862b0860c49c87a76b02218f8e4118134acfb89&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The only resume parser that didn&amp;#39;t seem abysmal was the one from Smart Recruiters. TikTok&amp;#39;s resume parser also isn&amp;#39;t bad.&lt;/p&gt;\n\n&lt;p&gt;Another frustrating experience is tied to inconsistency between the company I&amp;#39;m applying to and the ATS.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/9xzq21vpwyxb1.png?width=350&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=8432b293be4db0f58770760097df0117b53e667e\"&gt;https://preview.redd.it/9xzq21vpwyxb1.png?width=350&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=8432b293be4db0f58770760097df0117b53e667e&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;A company’s application process is often the first touchpoint you have with their brand. Startups competing for the best talent can&amp;#39;t afford extra steps in their process. Apple and Facebook can.&lt;/p&gt;\n\n&lt;p&gt;Whilst the average time to complete a job application may only be 162 seconds, the fact that many ATS require steps like account creation and authentication can lead to application fatigue.&lt;/p&gt;\n\n&lt;p&gt;It’s not necessarily the explicit amount of time it takes, it’s the steps involved that drain you of energy and make you want to avoid applying to new jobs.&lt;/p&gt;\n\n&lt;h1&gt;Industry&lt;/h1&gt;\n\n&lt;p&gt;Okay, so far we’ve looked at company size and the ATS as a loose indicator of what might make a job application frustrating. What about the company industry?&lt;/p&gt;\n\n&lt;p&gt;You would expect industries like banking or professional services to have longer application times, because getting those jobs revolves around having a bunch of credentials which they likely screen for (and ask you to submit) early on in the process.&lt;/p&gt;\n\n&lt;p&gt;On the other hand, internet startups I’d expect to be quick and fast. Let’s find out if this is true.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/i7825ssvwyxb1.png?width=4012&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=3f51989a663cf7b8c664eacb983a9be0a8dbc80b\"&gt;https://preview.redd.it/i7825ssvwyxb1.png?width=4012&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=3f51989a663cf7b8c664eacb983a9be0a8dbc80b&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Hyped up industries like AI and Crypto have shorter application times. As expected, banks and consulting firms care about your GPA and ask you to submit it.&lt;/p&gt;\n\n&lt;p&gt;A government company has to basically verify your identity before they can even receive your application, so the process is entirely different and reflected in the submission time.&lt;/p&gt;\n\n&lt;p&gt;For many technology companies, the application process is almost like an extension of the company’s brand itself. For example, Plaid (an API first Fintech company), has a neat option where you can actually apply to the job via API:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/px5k5wwxwyxb1.png?width=720&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=d669e7e47e77e51d48a4867a2d06d27125617ed8\"&gt;https://preview.redd.it/px5k5wwxwyxb1.png?width=720&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=d669e7e47e77e51d48a4867a2d06d27125617ed8&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Roblox, a gaming company, allows people to submit job applications from within their &lt;a href=\"https://gamerant.com/roblox-company-interview-job-applicants-in-game/\"&gt;games&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;We also notice differences between legacy companies and their newer competitors. If we compare legacy banks versus neobanks (like Monzo, Mercury, etc), the legacy players averaged around 250 seconds per job application whereas the neobanks averaged less than 60 seconds.&lt;/p&gt;\n\n&lt;p&gt;If you can’t compete on prestige, you need to find other ways. One of those ways can be through asking for less information upfront.&lt;/p&gt;\n\n&lt;h1&gt;Putting it together&lt;/h1&gt;\n\n&lt;p&gt;Now that we&amp;#39;ve analyzed each variable - the company size, ATS, and the industry - to understand the separate relationship of each to application time, we can use linear regression to understand the &lt;em&gt;combined&lt;/em&gt; relationships.&lt;/p&gt;\n\n&lt;p&gt;This will allow us to determine what factors actually have an impact on the job application time versus which ones might just have had one when we looked at them in isolation.&lt;/p&gt;\n\n&lt;p&gt;After some number crunching in R, I get the following results (I’ve only added the statistically significant factors – the ones with the “strongest evidence”):&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/g2pg1o11xyxb1.png?width=2496&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=2efc92ad2cfa4aaf25297d23c228d0c7343729f9\"&gt;https://preview.redd.it/g2pg1o11xyxb1.png?width=2496&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=2efc92ad2cfa4aaf25297d23c228d0c7343729f9&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Here’s how you can interpret some of the information above:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;When a job app is for a company that is within the Government industry, the submission time goes up by 366% (assuming the size and ATS are constant). For the aerospace industry, this is 249% (and so on).&lt;/li&gt;\n&lt;li&gt;When a job app is for a company using the Workday ATS, the submission times goes up by 128% (assuming the size and industry are constant). For the Phenom ATS, this is 110% (and so on).&lt;/li&gt;\n&lt;li&gt;Our only (statistically significant) metric which seems to make job applications faster is the Lever ATS (42% shorter).&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Okay, now what about company size?&lt;/p&gt;\n\n&lt;p&gt;Well, first up: company size is indeed statistically significant. So there is an effect.&lt;/p&gt;\n\n&lt;p&gt;However, its effect is not as strong as most of our other variables. To be precise, here are some ways to interpret our company size coefficient:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;If company size doubles, the app size increases by 5%&lt;/li&gt;\n&lt;li&gt;If company size increases by a factor of 10, then the app time increases by 20%&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;This is a smaller effect size compared to ATS or industry (a 20% increases in app time for a 10x large company is a qualitatively smaller effect size than e.g. a 100% increase in app time for Taleo ATS). So although company size is statistically significant, it is not as strong of a driver as ATS and industry of app time.&lt;/p&gt;\n\n&lt;h1&gt;Wrapping it up&lt;/h1&gt;\n\n&lt;p&gt;Two and a half minutes might not be too long, but it can feel like an eternity when you’re forced to answer the same questions and upload the same documents. Over and over again.&lt;/p&gt;\n\n&lt;p&gt;Think about catching a flight. All you want is to get on the jet. Hawaii awaits.&lt;/p&gt;\n\n&lt;p&gt;But first: the security line. You have to take your shoes off. You get patted down and your bag gets searched. The gate numbers don’t make sense. And then at the end of it, your flight’s delayed. Congrats.&lt;/p&gt;\n\n&lt;p&gt;Applying to a job can feel similar. All you want to do is say aloha to the hiring manager, a real human being.&lt;/p&gt;\n\n&lt;p&gt;To even have the remote possibility of making that happen, you need to create an account and password, check your email, retype your entire resume, tell them the color of your skin, and explain why this company you’ve never heard of before is the greatest thing on Earth.&lt;/p&gt;\n\n&lt;p&gt;And for what? Most likely for the privilege of receiving an automated email about two weeks later rejecting you.&lt;/p&gt;\n\n&lt;p&gt;If we make it tiring and unappealing to look for new opportunities, then we prevent people from doing their best work.&lt;/p&gt;\n\n&lt;p&gt;But what would a world where applying took just a few seconds actually look like? Recruiters would get bombarded with resumes. It&amp;#39;s possible to argue that job applications taking so long is a feature, not a bug. You get to filter for intent and narrow down your application pool.&lt;/p&gt;\n\n&lt;p&gt;Is it fair to shift the burden of screening unqualified candidates onto good candidates that now need to provide so much information? Shouldn’t that burden fall on the recruiter?&lt;/p&gt;\n\n&lt;p&gt;The truth is that applying to a job via the careers page is a bit of a rigged game. The odds are not in your favor.&lt;/p&gt;\n\n&lt;p&gt;Sometimes, though, all you need is to only be right once.&lt;/p&gt;\n\n&lt;p&gt;***&lt;/p&gt;\n\n&lt;p&gt;If you made it all the way to the bottom, you&amp;#39;re a star. This took a while to write. I hope you enjoyed it.&lt;/p&gt;\n\n&lt;p&gt;For more content like this, &lt;a href=\"https://www.careerfair.io/subscribe\"&gt;subscribe&lt;/a&gt; to my newsletter. It&amp;#39;s my best content delivered to your inbox ~once a month.&lt;/p&gt;\n\n&lt;p&gt;Any questions and I&amp;#39;ll be in the comments :)&lt;/p&gt;\n\n&lt;p&gt;- Shikhar&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/eSwdItrJS3E9Ig_ezAnCfd0f92B9-nGOnJqjeMTjbn8.jpg?auto=webp&amp;s=bbd95f2ed618418523e221ff7c41ba6dd9f9357c", "width": 1200, "height": 628}, "resolutions": [{"url": "https://external-preview.redd.it/eSwdItrJS3E9Ig_ezAnCfd0f92B9-nGOnJqjeMTjbn8.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=0d2d78497c444436ee3852abc1d16b9015582900", "width": 108, "height": 56}, {"url": "https://external-preview.redd.it/eSwdItrJS3E9Ig_ezAnCfd0f92B9-nGOnJqjeMTjbn8.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=ee5de67218e64b1a8a2d0074e79794deb2fdfe59", "width": 216, "height": 113}, {"url": "https://external-preview.redd.it/eSwdItrJS3E9Ig_ezAnCfd0f92B9-nGOnJqjeMTjbn8.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=e1208ab3326e226f1ce06fc0118a968b950ccb0c", "width": 320, "height": 167}, {"url": "https://external-preview.redd.it/eSwdItrJS3E9Ig_ezAnCfd0f92B9-nGOnJqjeMTjbn8.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=6f6b27f6c5034f0e5f9084e9ee514c8477743d62", "width": 640, "height": 334}, {"url": "https://external-preview.redd.it/eSwdItrJS3E9Ig_ezAnCfd0f92B9-nGOnJqjeMTjbn8.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=0116da259229cf5a6e961783fd2ca9cd6c557f9b", "width": 960, "height": 502}, {"url": "https://external-preview.redd.it/eSwdItrJS3E9Ig_ezAnCfd0f92B9-nGOnJqjeMTjbn8.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=424b98448153dbeb8f5c083fe4d33e1a8fab1934", "width": 1080, "height": 565}], "variants": {}, "id": "vIljQHhOnaGyxw1J0M9V8Ba6jkXChTACPR67t5J3Nmc"}], "enabled": false}, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "b026063c-d780-11e7-aba9-0e030591a4b4", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "mod_note": null, "distinguished": null, "subreddit_id": "t5_2sptq", "author_is_blocked": false, "mod_reason_by": null, "num_reports": null, "removal_reason": null, "link_flair_background_color": "#0079d3", "id": "17m8la5", "is_robot_indexable": true, "report_reasons": null, "author": "ibsurvivors", "discussion_type": null, "num_comments": 82, "send_replies": true, "whitelist_status": "all_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/datascience/comments/17m8la5/i_applied_to_250_jobs_and_timed_how_long_each_one/", "parent_whitelist_status": "all_ads", "stickied": false, "url": "https://old.reddit.com/r/datascience/comments/17m8la5/i_applied_to_250_jobs_and_timed_how_long_each_one/", "subreddit_subscribers": 1110707, "created_utc": 1698945535.0, "num_crossposts": 0, "media": null, "is_video": false}}, {"kind": "t3", "data": {"approved_at_utc": null, "subreddit": "datascience", "selftext": "We've set up a Pre-Post Test model using the [Causal Impact](https://google.github.io/CausalImpact/CausalImpact.html) package in R, which basically works like this:\n\n* The user feeds it a target and covariates\n* The model uses the covariates to predict the target\n* It uses the residuals in the post-test period to measure the effect of the change\n\nGreat -- except that I'm coming to a challenge I have again and again with statistical models, which is that tiny changes to the model completely change the results.\n\nWe are training the models on earlier data and checking the RMSE to ensure goodness of fit before using it on the actual test data, but I can use two models with near-identical RMSEs and have one test be positive and the other be negative.\n\nThe conventional wisdom I've always been told was not to peek at your data and not to tweak it once you've run the test, but that feels incorrect to me. My instinct is that, if you tweak your model slightly and get a different result, it's a good indicator that your results are not reproducible.\n\nSo I'm curious how other people handle this. I've been considering setting up the model to identify 5 settings with low RMSEs, run them all, and check for consistency of results, but that might be a bit drastic.\n\nHow do you other people handle this?", "author_fullname": "t2_bxdnw", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "How do you avoid p-hacking?", "link_flair_richtext": [], "subreddit_name_prefixed": "r/datascience", "hidden": false, "pwls": 6, "link_flair_css_class": "", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_17m2b07", "quarantine": false, "link_flair_text_color": "dark", "upvote_ratio": 0.96, "author_flair_background_color": null, "subreddit_type": "public", "ups": 105, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Statistics", "can_mod_post": false, "score": 105, "approved_by": null, "is_created_from_ads_ui": false, "author_premium": false, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "content_categories": null, "is_self": true, "mod_note": null, "created": 1698927897.0, "link_flair_type": "text", "wls": 6, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.datascience", "allow_live_comments": false, "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We&amp;#39;ve set up a Pre-Post Test model using the &lt;a href=\"https://google.github.io/CausalImpact/CausalImpact.html\"&gt;Causal Impact&lt;/a&gt; package in R, which basically works like this:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;The user feeds it a target and covariates&lt;/li&gt;\n&lt;li&gt;The model uses the covariates to predict the target&lt;/li&gt;\n&lt;li&gt;It uses the residuals in the post-test period to measure the effect of the change&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Great -- except that I&amp;#39;m coming to a challenge I have again and again with statistical models, which is that tiny changes to the model completely change the results.&lt;/p&gt;\n\n&lt;p&gt;We are training the models on earlier data and checking the RMSE to ensure goodness of fit before using it on the actual test data, but I can use two models with near-identical RMSEs and have one test be positive and the other be negative.&lt;/p&gt;\n\n&lt;p&gt;The conventional wisdom I&amp;#39;ve always been told was not to peek at your data and not to tweak it once you&amp;#39;ve run the test, but that feels incorrect to me. My instinct is that, if you tweak your model slightly and get a different result, it&amp;#39;s a good indicator that your results are not reproducible.&lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;m curious how other people handle this. I&amp;#39;ve been considering setting up the model to identify 5 settings with low RMSEs, run them all, and check for consistency of results, but that might be a bit drastic.&lt;/p&gt;\n\n&lt;p&gt;How do you other people handle this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "370e8fc0-70eb-11ee-b58a-86a96bfd3389", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2sptq", "author_is_blocked": false, "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#94e044", "id": "17m2b07", "is_robot_indexable": true, "report_reasons": null, "author": "takenorinvalid", "discussion_type": null, "num_comments": 56, "send_replies": true, "whitelist_status": "all_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/datascience/comments/17m2b07/how_do_you_avoid_phacking/", "parent_whitelist_status": "all_ads", "stickied": false, "url": "https://old.reddit.com/r/datascience/comments/17m2b07/how_do_you_avoid_phacking/", "subreddit_subscribers": 1110707, "created_utc": 1698927897.0, "num_crossposts": 0, "media": null, "is_video": false}}, {"kind": "t3", "data": {"approved_at_utc": null, "subreddit": "datascience", "selftext": "I’m an MS statistician whose gonna be starting a data scientist position soon. I think one of the things I’m the most confident about is my statistical analysis and overarching background I have on methods. I am fairly comfortable I can handle up to 95% of weird data sets, and know how to properly assess assumptions, critically look at data, and choose the right model or tool for the job. I’m even more confident in my ability to present and explain interpretations of results, because that’s what is also emphasized in our applied coursework. With a good background in stats, I’m fairly confident in the actual “doing” of data analysis and wrangling and what not.\n\nBut I think the part I’m not really sure about or worried I’ll be bad at is “connecting the dots” between my stats stuff and the business problem. A lot of what I’m worried about is that I can do all of this stuff to understand the data, but if I don’t even understand the context well enough, then my analysis has no path to follow. This ambiguity is something I know I’m going to struggle with, and I’m not sure how I’m going to improve in this area besides talking to more of the stakeholders.\n\nBut for any statisticians here who turned to DS, what kind of things did you do to improve this aspect? How did you “connect” the business side to the hard core stats side?", "author_fullname": "t2_i69qgpqa", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "Statisticians in DS, how did you “connect the dots” between business skills and theory?", "link_flair_richtext": [], "subreddit_name_prefixed": "r/datascience", "hidden": false, "pwls": 6, "link_flair_css_class": "discussion", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_17m7q3j", "quarantine": false, "link_flair_text_color": "dark", "upvote_ratio": 0.96, "author_flair_background_color": null, "subreddit_type": "public", "ups": 51, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Discussion", "can_mod_post": false, "score": 51, "approved_by": null, "is_created_from_ads_ui": false, "author_premium": false, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "content_categories": null, "is_self": true, "mod_note": null, "created": 1698943279.0, "link_flair_type": "text", "wls": 6, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.datascience", "allow_live_comments": false, "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m an MS statistician whose gonna be starting a data scientist position soon. I think one of the things I’m the most confident about is my statistical analysis and overarching background I have on methods. I am fairly comfortable I can handle up to 95% of weird data sets, and know how to properly assess assumptions, critically look at data, and choose the right model or tool for the job. I’m even more confident in my ability to present and explain interpretations of results, because that’s what is also emphasized in our applied coursework. With a good background in stats, I’m fairly confident in the actual “doing” of data analysis and wrangling and what not.&lt;/p&gt;\n\n&lt;p&gt;But I think the part I’m not really sure about or worried I’ll be bad at is “connecting the dots” between my stats stuff and the business problem. A lot of what I’m worried about is that I can do all of this stuff to understand the data, but if I don’t even understand the context well enough, then my analysis has no path to follow. This ambiguity is something I know I’m going to struggle with, and I’m not sure how I’m going to improve in this area besides talking to more of the stakeholders.&lt;/p&gt;\n\n&lt;p&gt;But for any statisticians here who turned to DS, what kind of things did you do to improve this aspect? How did you “connect” the business side to the hard core stats side?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "4fad7108-d77d-11e7-b0c6-0ee69f155af2", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2sptq", "author_is_blocked": false, "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#1a1a1b", "id": "17m7q3j", "is_robot_indexable": true, "report_reasons": null, "author": "AdFew4357", "discussion_type": null, "num_comments": 84, "send_replies": true, "whitelist_status": "all_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/datascience/comments/17m7q3j/statisticians_in_ds_how_did_you_connect_the_dots/", "parent_whitelist_status": "all_ads", "stickied": false, "url": "https://old.reddit.com/r/datascience/comments/17m7q3j/statisticians_in_ds_how_did_you_connect_the_dots/", "subreddit_subscribers": 1110707, "created_utc": 1698943279.0, "num_crossposts": 0, "media": null, "is_video": false}}, {"kind": "t3", "data": {"approved_at_utc": null, "subreddit": "datascience", "selftext": "Title. We've given way, for now, to the Data Engineers and Architects to build out pipelines and such and until those are complete, we haven't had a ton of requests coming in.\n\nWhen things are \"slow\" for your teams, what type of work are you having the junior scientists working on to maintain some level of productivity or skillset building?", "author_fullname": "t2_10u9hi", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "DS Team Leaders, When requests are slow or little volume, what are you having your team work on in the meantime?", "link_flair_richtext": [], "subreddit_name_prefixed": "r/datascience", "hidden": false, "pwls": 6, "link_flair_css_class": "discussion", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_17m4paw", "quarantine": false, "link_flair_text_color": "dark", "upvote_ratio": 0.93, "author_flair_background_color": null, "subreddit_type": "public", "ups": 32, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Discussion", "can_mod_post": false, "score": 32, "approved_by": null, "is_created_from_ads_ui": false, "author_premium": false, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "content_categories": null, "is_self": true, "mod_note": null, "created": 1698935234.0, "link_flair_type": "text", "wls": 6, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.datascience", "allow_live_comments": false, "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Title. We&amp;#39;ve given way, for now, to the Data Engineers and Architects to build out pipelines and such and until those are complete, we haven&amp;#39;t had a ton of requests coming in.&lt;/p&gt;\n\n&lt;p&gt;When things are &amp;quot;slow&amp;quot; for your teams, what type of work are you having the junior scientists working on to maintain some level of productivity or skillset building?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "4fad7108-d77d-11e7-b0c6-0ee69f155af2", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2sptq", "author_is_blocked": false, "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#1a1a1b", "id": "17m4paw", "is_robot_indexable": true, "report_reasons": null, "author": "LionsBSanders20", "discussion_type": null, "num_comments": 35, "send_replies": true, "whitelist_status": "all_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/datascience/comments/17m4paw/ds_team_leaders_when_requests_are_slow_or_little/", "parent_whitelist_status": "all_ads", "stickied": false, "url": "https://old.reddit.com/r/datascience/comments/17m4paw/ds_team_leaders_when_requests_are_slow_or_little/", "subreddit_subscribers": 1110707, "created_utc": 1698935234.0, "num_crossposts": 0, "media": null, "is_video": false}}, {"kind": "t3", "data": {"approved_at_utc": null, "subreddit": "datascience", "selftext": "Or is it essentially seen as marginal? I suspect the larger companies would view it as marginal, and startups up to medium size (with small data teams) would be attracted by this experience. Is that a fair assumption?", "author_fullname": "t2_3uoce3bn", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "Is analytics engineering and business intelligence experience beneficial for seeking DS roles?", "link_flair_richtext": [], "subreddit_name_prefixed": "r/datascience", "hidden": false, "pwls": 6, "link_flair_css_class": "fun", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_17m6b4n", "quarantine": false, "link_flair_text_color": "dark", "upvote_ratio": 0.88, "author_flair_background_color": null, "subreddit_type": "public", "ups": 12, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Career Discussion", "can_mod_post": false, "score": 12, "approved_by": null, "is_created_from_ads_ui": false, "author_premium": false, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "content_categories": null, "is_self": true, "mod_note": null, "created": 1698939590.0, "link_flair_type": "text", "wls": 6, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.datascience", "allow_live_comments": false, "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Or is it essentially seen as marginal? I suspect the larger companies would view it as marginal, and startups up to medium size (with small data teams) would be attracted by this experience. Is that a fair assumption?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "b026063c-d780-11e7-aba9-0e030591a4b4", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2sptq", "author_is_blocked": false, "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#0079d3", "id": "17m6b4n", "is_robot_indexable": true, "report_reasons": null, "author": "Tender_Figs", "discussion_type": null, "num_comments": 16, "send_replies": true, "whitelist_status": "all_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/datascience/comments/17m6b4n/is_analytics_engineering_and_business/", "parent_whitelist_status": "all_ads", "stickied": false, "url": "https://old.reddit.com/r/datascience/comments/17m6b4n/is_analytics_engineering_and_business/", "subreddit_subscribers": 1110707, "created_utc": 1698939590.0, "num_crossposts": 0, "media": null, "is_video": false}}, {"kind": "t3", "data": {"approved_at_utc": null, "subreddit": "datascience", "selftext": "", "author_fullname": "t2_uvp5yieu", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "Can someone help explain the data structure of the m4 forecasting datasets?", "link_flair_richtext": [], "subreddit_name_prefixed": "r/datascience", "hidden": false, "pwls": 6, "link_flair_css_class": "", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_17meviz", "quarantine": false, "link_flair_text_color": "dark", "upvote_ratio": 1.0, "author_flair_background_color": null, "subreddit_type": "public", "ups": 3, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Challenges", "can_mod_post": false, "score": 3, "approved_by": null, "is_created_from_ads_ui": false, "author_premium": false, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "content_categories": null, "is_self": true, "mod_note": null, "created": 1698961950.0, "link_flair_type": "text", "wls": 6, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.datascience", "allow_live_comments": false, "selftext_html": null, "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "417296a0-70eb-11ee-8c58-122e95e91c4c", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2sptq", "author_is_blocked": false, "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#ffd635", "id": "17meviz", "is_robot_indexable": true, "report_reasons": null, "author": "house_lite", "discussion_type": null, "num_comments": 5, "send_replies": true, "whitelist_status": "all_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/datascience/comments/17meviz/can_someone_help_explain_the_data_structure_of/", "parent_whitelist_status": "all_ads", "stickied": false, "url": "https://old.reddit.com/r/datascience/comments/17meviz/can_someone_help_explain_the_data_structure_of/", "subreddit_subscribers": 1110707, "created_utc": 1698961950.0, "num_crossposts": 0, "media": null, "is_video": false}}, {"kind": "t3", "data": {"approved_at_utc": null, "subreddit": "datascience", "selftext": "I'm planning to attend ICML 2024 in person. Can somebody share their experience of attending the conference? Is it worth attending if you don't have any paper to present? If yes, how to get the most out of it?", "author_fullname": "t2_d1p28kh", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "Can somebody share their experience of attending ICML conference?", "link_flair_richtext": [], "subreddit_name_prefixed": "r/datascience", "hidden": false, "pwls": 6, "link_flair_css_class": "discussion", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_17m17c7", "quarantine": false, "link_flair_text_color": "dark", "upvote_ratio": 1.0, "author_flair_background_color": null, "subreddit_type": "public", "ups": 2, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Discussion", "can_mod_post": false, "score": 2, "approved_by": null, "is_created_from_ads_ui": false, "author_premium": false, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "content_categories": null, "is_self": true, "mod_note": null, "created": 1698923886.0, "link_flair_type": "text", "wls": 6, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.datascience", "allow_live_comments": false, "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m planning to attend ICML 2024 in person. Can somebody share their experience of attending the conference? Is it worth attending if you don&amp;#39;t have any paper to present? If yes, how to get the most out of it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "4fad7108-d77d-11e7-b0c6-0ee69f155af2", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2sptq", "author_is_blocked": false, "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#1a1a1b", "id": "17m17c7", "is_robot_indexable": true, "report_reasons": null, "author": "cpluscplus", "discussion_type": null, "num_comments": 3, "send_replies": true, "whitelist_status": "all_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/datascience/comments/17m17c7/can_somebody_share_their_experience_of_attending/", "parent_whitelist_status": "all_ads", "stickied": false, "url": "https://old.reddit.com/r/datascience/comments/17m17c7/can_somebody_share_their_experience_of_attending/", "subreddit_subscribers": 1110707, "created_utc": 1698923886.0, "num_crossposts": 0, "media": null, "is_video": false}}, {"kind": "t3", "data": {"approved_at_utc": null, "subreddit": "datascience", "selftext": "Hi, I recently got accepted into OMSA, and was considering asking my job (analyst) to pay for it (general policy is 5000 in support a year). However, I’ve only been at the company for a year and have really just started my career. Would this be a red flag to my manager?  Is it too early to be considering grad school to them? Should I just keep this to myself and self fund it?", "author_fullname": "t2_lpycqkc", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "Too soon to ask for tuition assistance?", "link_flair_richtext": [], "subreddit_name_prefixed": "r/datascience", "hidden": false, "pwls": 6, "link_flair_css_class": "", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_17mr39m", "quarantine": false, "link_flair_text_color": "dark", "upvote_ratio": 1.0, "author_flair_background_color": null, "subreddit_type": "public", "ups": 1, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Education", "can_mod_post": false, "score": 1, "approved_by": null, "is_created_from_ads_ui": false, "author_premium": false, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "content_categories": null, "is_self": true, "mod_note": null, "created": 1699003501.0, "link_flair_type": "text", "wls": 6, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.datascience", "allow_live_comments": false, "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi, I recently got accepted into OMSA, and was considering asking my job (analyst) to pay for it (general policy is 5000 in support a year). However, I’ve only been at the company for a year and have really just started my career. Would this be a red flag to my manager?  Is it too early to be considering grad school to them? Should I just keep this to myself and self fund it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": true, "is_crosspostable": false, "pinned": false, "over_18": false, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "1b37a3ae-70eb-11ee-b5c7-7e3a672f3d51", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2sptq", "author_is_blocked": false, "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#00a6a5", "id": "17mr39m", "is_robot_indexable": true, "report_reasons": null, "author": "supplejoe", "discussion_type": null, "num_comments": 2, "send_replies": true, "whitelist_status": "all_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/datascience/comments/17mr39m/too_soon_to_ask_for_tuition_assistance/", "parent_whitelist_status": "all_ads", "stickied": false, "url": "https://old.reddit.com/r/datascience/comments/17mr39m/too_soon_to_ask_for_tuition_assistance/", "subreddit_subscribers": 1110707, "created_utc": 1699003501.0, "num_crossposts": 0, "media": null, "is_video": false}}, {"kind": "t3", "data": {"approved_at_utc": null, "subreddit": "datascience", "selftext": "Hi , \n\nI have a dataset with a dependent variable and two explanatory variables. A binary treatment variable and quantitative time since treatment for the cases that received treatment and NA for none-treated cases.  \n\n&amp;#x200B;\n\nIs it possible to include both in a single glmm? \n\nI'm using glmmtmb in R and the function can only handle NAs by omitting the cases with Na and it would mean here omitting all the non-treated cases from the analysis. \n\nI'd appreciate your thoughts and ideas.\n\n \n\n&amp;#x200B;", "author_fullname": "t2_5cv4sbzc", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "running glmm with binary treatment variable and time since treatment", "link_flair_richtext": [], "subreddit_name_prefixed": "r/datascience", "hidden": false, "pwls": 6, "link_flair_css_class": "", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_17m4mmu", "quarantine": false, "link_flair_text_color": "dark", "upvote_ratio": 1.0, "author_flair_background_color": null, "subreddit_type": "public", "ups": 1, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Statistics", "can_mod_post": false, "score": 1, "approved_by": null, "is_created_from_ads_ui": false, "author_premium": false, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "content_categories": null, "is_self": true, "mod_note": null, "created": 1698935024.0, "link_flair_type": "text", "wls": 6, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.datascience", "allow_live_comments": false, "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi , &lt;/p&gt;\n\n&lt;p&gt;I have a dataset with a dependent variable and two explanatory variables. A binary treatment variable and quantitative time since treatment for the cases that received treatment and NA for none-treated cases.  &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Is it possible to include both in a single glmm? &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m using glmmtmb in R and the function can only handle NAs by omitting the cases with Na and it would mean here omitting all the non-treated cases from the analysis. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d appreciate your thoughts and ideas.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": true, "is_crosspostable": false, "pinned": false, "over_18": false, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "370e8fc0-70eb-11ee-b58a-86a96bfd3389", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2sptq", "author_is_blocked": false, "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#94e044", "id": "17m4mmu", "is_robot_indexable": true, "report_reasons": null, "author": "TheReal_KindStranger", "discussion_type": null, "num_comments": 4, "send_replies": true, "whitelist_status": "all_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/datascience/comments/17m4mmu/running_glmm_with_binary_treatment_variable_and/", "parent_whitelist_status": "all_ads", "stickied": false, "url": "https://old.reddit.com/r/datascience/comments/17m4mmu/running_glmm_with_binary_treatment_variable_and/", "subreddit_subscribers": 1110707, "created_utc": 1698935024.0, "num_crossposts": 0, "media": null, "is_video": false}}, {"kind": "t3", "data": {"approved_at_utc": null, "subreddit": "datascience", "selftext": "... and what makes a bad DSM", "author_fullname": "t2_3op9qx89", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "What makes an average Data Science Manager an Excellent DSM?", "link_flair_richtext": [], "subreddit_name_prefixed": "r/datascience", "hidden": false, "pwls": 6, "link_flair_css_class": "discussion", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_17mps8p", "quarantine": false, "link_flair_text_color": "dark", "upvote_ratio": 0.5, "author_flair_background_color": null, "subreddit_type": "public", "ups": 0, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Discussion", "can_mod_post": false, "score": 0, "approved_by": null, "is_created_from_ads_ui": false, "author_premium": false, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "content_categories": null, "is_self": true, "mod_note": null, "created": 1698997439.0, "link_flair_type": "text", "wls": 6, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.datascience", "allow_live_comments": false, "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;... and what makes a bad DSM&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": true, "is_crosspostable": false, "pinned": false, "over_18": false, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "4fad7108-d77d-11e7-b0c6-0ee69f155af2", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2sptq", "author_is_blocked": false, "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#1a1a1b", "id": "17mps8p", "is_robot_indexable": true, "report_reasons": null, "author": "LatterConcentrate6", "discussion_type": null, "num_comments": 5, "send_replies": true, "whitelist_status": "all_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/datascience/comments/17mps8p/what_makes_an_average_data_science_manager_an/", "parent_whitelist_status": "all_ads", "stickied": false, "url": "https://old.reddit.com/r/datascience/comments/17mps8p/what_makes_an_average_data_science_manager_an/", "subreddit_subscribers": 1110707, "created_utc": 1698997439.0, "num_crossposts": 0, "media": null, "is_video": false}}], "before": null}}