{"kind": "Listing", "data": {"after": null, "dist": 4, "modhash": "", "geo_filter": "", "children": [{"kind": "t3", "data": {"approved_at_utc": null, "subreddit": "datascience", "selftext": "I've been asked to consolidate and rebuild a data team after a spree of layoffs and reorgs. People have to be realigned to newer projects and priorities. Some of the projects they were working on were scrapped entirely due to lack of funding. As the layoffs would still continue, I want this new  team to be \"not on the list\" as much as possible.\n\nIf you had the chance to build a team from scratch, what would you do?", "author_fullname": "t2_al1087x2", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "If you had a chance to rebuild your DS/DE team, how would you do it?", "link_flair_richtext": [], "subreddit_name_prefixed": "r/datascience", "hidden": false, "pwls": 6, "link_flair_css_class": "discussion", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_17ndvwn", "quarantine": false, "link_flair_text_color": "dark", "upvote_ratio": 0.77, "author_flair_background_color": null, "subreddit_type": "public", "ups": 30, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Discussion", "can_mod_post": false, "score": 30, "approved_by": null, "is_created_from_ads_ui": false, "author_premium": false, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "content_categories": null, "is_self": true, "mod_note": null, "created": 1699072139.0, "link_flair_type": "text", "wls": 6, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.datascience", "allow_live_comments": false, "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been asked to consolidate and rebuild a data team after a spree of layoffs and reorgs. People have to be realigned to newer projects and priorities. Some of the projects they were working on were scrapped entirely due to lack of funding. As the layoffs would still continue, I want this new  team to be &amp;quot;not on the list&amp;quot; as much as possible.&lt;/p&gt;\n\n&lt;p&gt;If you had the chance to build a team from scratch, what would you do?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "4fad7108-d77d-11e7-b0c6-0ee69f155af2", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2sptq", "author_is_blocked": false, "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#1a1a1b", "id": "17ndvwn", "is_robot_indexable": true, "report_reasons": null, "author": "OverratedDataScience", "discussion_type": null, "num_comments": 33, "send_replies": true, "whitelist_status": "all_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/datascience/comments/17ndvwn/if_you_had_a_chance_to_rebuild_your_dsde_team_how/", "parent_whitelist_status": "all_ads", "stickied": false, "url": "https://old.reddit.com/r/datascience/comments/17ndvwn/if_you_had_a_chance_to_rebuild_your_dsde_team_how/", "subreddit_subscribers": 1112466, "created_utc": 1699072139.0, "num_crossposts": 0, "media": null, "is_video": false}}, {"kind": "t3", "data": {"approved_at_utc": null, "subreddit": "datascience", "selftext": "I got laid off earlier this year, and had to choose between 4 competitive data science offers at a handful of big companies. I chose what I felt was the best after evaluating each of them. My boss is ok, but there are several red flags that are really making me regret choosing this company. \n\n**Red flag number 1: They don't respect for your time.**\n\nMy new boss has on several occasions reached out to me at the very end of the day asking for an update, or wanting to \"jump on a quick call\" which results in me staying until 5:30-6 PM while everyone else is leaving the office at exactly 5 PM. He often makes lame jokes about it too. \"Let me ping this other guy to ask a quick question... Says he's offline, what the heck? Does everyone just stop working at 5 these days?\"\n\nA 9 to 5 job means 9 to 5. If you're not being paid overtime, then don't reach out to me at 4:50 PM. That's lame, and unethical\n\n**Red flag number 2: Hustle culture.** \n\nIf you start a new job, and your boss says things like \"get the ball rolling\", \"trial by fire\", \"thrown into the deep end\", \"someone who is ready to dive right in on day 1\" HUGE red flag. This means you're likely not going to get any time to learn the ropes, meet your team, ease into your role. For me in this new job, it means I'm being thrown a bunch of tasks and objectives right off the bad, and expected to perform at the same level as everyone else, knowing little to nothing about the business or my job. That's bullsh\\*t. \n\nAdditionally, if you're not working in an Agile environment, meaning you're not expressly told up front \"we use Agile here, so there are sprints\", then there's no reason to be rushing to get things done *all the time*. I understand there are times when you're on a time crunch. But if you're constantly being rushed on everything, then that's bullsh\\*t. Like seriously, sending an email, or updating a Power BI dashboard with a minor change isn't a mission critical thing. Calm down. \n\n**Red flag number 3: They're annoying or insufferable**\n\nI get that bosses are in a position where they are directly responsible for your performance, which makes it hard to be friends with them. But at the very least, you should be able to have a good working relationship with them. This is incredibly difficult if they are annoying or just plain insufferable. In my previous job, I had a boss who thought they were so funny and clever. Without consenting or consulting me, they volunteered me for an extracurricular project that was supposed to be opt-in which means you would have to actually sign up for the project voluntarily. But they didn't care about that, they jokingly said \"I took the Liberty of signing you up for it Because you asked about it. That's what happens when you ask questions here! Haha!!! You don't need to thank me!\" What was the extracurricular project? Spending 20 hours a week for 3 weeks working on a massive data set, and then presenting it in a Power BI dashboard to a bunch of people. I actually enjoyed the project, but it was a bit disrespectful to do that without even asking me, and then to be so cheeky and annoying about it....\n\n\nTo make matters worse, we had this truly pointless team meeting every single week without fail where we did a round robin coming through details of what each of us was working on that week, and it was painful. Truly painful. I'm not talking a high level, I'm talking full PowerPoint slides, line by line description of what each and every one of us was working on, and it wasn't with the director of our team. It was just with our manager. Utterly pointless meeting that wasted 2 hours of our time every week, and it was unanimously disliked across our whole team. But we still had to do it because the manager felt it was necessary. Why? Because I want it. Does it add anything to our performance or enhance anything, or do anything for us? No. Then why do it? Because I want to. Utter absurdity \n\n\nI personally can't condone working for someone You can't feel comfortable around on a daily basis. It will really bother you long-term. \n\n\n\n**Red flag number 4: They don't want you to advance your career for their own personal reasons**\n\n\nI had a boss that told me they don't want me to apply to other roles that are more senior, or that they don't want me moving to another team in the company ever, they frown upon that, because they don't like too much turnover. In other words, they don't want to do their job as a manager or leader, and hire people. The other absurdity of saying something like this.... I wish I was joking, but I'm completely serious. A lot of leaders might not say it, because they think they are so clever they can just hide it from you. But for a lot of them, they have zero intention of letting you move up anywhere in the company no matter how well you perform. \n\n\n\n\n\nJust sharing some of my own experiences in case it helps anyone during this time of really high turnover", "author_fullname": "t2_dmawn6hx", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "There are some red flags in a boss or manager that everyone should be aware of", "link_flair_richtext": [], "subreddit_name_prefixed": "r/datascience", "hidden": false, "pwls": 6, "link_flair_css_class": "fun", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_17np0ou", "quarantine": false, "link_flair_text_color": "dark", "upvote_ratio": 0.68, "author_flair_background_color": null, "subreddit_type": "public", "ups": 15, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": true, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Career Discussion", "can_mod_post": false, "score": 15, "approved_by": null, "is_created_from_ads_ui": false, "author_premium": false, "thumbnail": "self", "edited": 1699116688.0, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "content_categories": null, "is_self": true, "mod_note": null, "created": 1699114423.0, "link_flair_type": "text", "wls": 6, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.datascience", "allow_live_comments": false, "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I got laid off earlier this year, and had to choose between 4 competitive data science offers at a handful of big companies. I chose what I felt was the best after evaluating each of them. My boss is ok, but there are several red flags that are really making me regret choosing this company. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Red flag number 1: They don&amp;#39;t respect for your time.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;My new boss has on several occasions reached out to me at the very end of the day asking for an update, or wanting to &amp;quot;jump on a quick call&amp;quot; which results in me staying until 5:30-6 PM while everyone else is leaving the office at exactly 5 PM. He often makes lame jokes about it too. &amp;quot;Let me ping this other guy to ask a quick question... Says he&amp;#39;s offline, what the heck? Does everyone just stop working at 5 these days?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;A 9 to 5 job means 9 to 5. If you&amp;#39;re not being paid overtime, then don&amp;#39;t reach out to me at 4:50 PM. That&amp;#39;s lame, and unethical&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Red flag number 2: Hustle culture.&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;If you start a new job, and your boss says things like &amp;quot;get the ball rolling&amp;quot;, &amp;quot;trial by fire&amp;quot;, &amp;quot;thrown into the deep end&amp;quot;, &amp;quot;someone who is ready to dive right in on day 1&amp;quot; HUGE red flag. This means you&amp;#39;re likely not going to get any time to learn the ropes, meet your team, ease into your role. For me in this new job, it means I&amp;#39;m being thrown a bunch of tasks and objectives right off the bad, and expected to perform at the same level as everyone else, knowing little to nothing about the business or my job. That&amp;#39;s bullsh*t. &lt;/p&gt;\n\n&lt;p&gt;Additionally, if you&amp;#39;re not working in an Agile environment, meaning you&amp;#39;re not expressly told up front &amp;quot;we use Agile here, so there are sprints&amp;quot;, then there&amp;#39;s no reason to be rushing to get things done &lt;em&gt;all the time&lt;/em&gt;. I understand there are times when you&amp;#39;re on a time crunch. But if you&amp;#39;re constantly being rushed on everything, then that&amp;#39;s bullsh*t. Like seriously, sending an email, or updating a Power BI dashboard with a minor change isn&amp;#39;t a mission critical thing. Calm down. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Red flag number 3: They&amp;#39;re annoying or insufferable&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I get that bosses are in a position where they are directly responsible for your performance, which makes it hard to be friends with them. But at the very least, you should be able to have a good working relationship with them. This is incredibly difficult if they are annoying or just plain insufferable. In my previous job, I had a boss who thought they were so funny and clever. Without consenting or consulting me, they volunteered me for an extracurricular project that was supposed to be opt-in which means you would have to actually sign up for the project voluntarily. But they didn&amp;#39;t care about that, they jokingly said &amp;quot;I took the Liberty of signing you up for it Because you asked about it. That&amp;#39;s what happens when you ask questions here! Haha!!! You don&amp;#39;t need to thank me!&amp;quot; What was the extracurricular project? Spending 20 hours a week for 3 weeks working on a massive data set, and then presenting it in a Power BI dashboard to a bunch of people. I actually enjoyed the project, but it was a bit disrespectful to do that without even asking me, and then to be so cheeky and annoying about it....&lt;/p&gt;\n\n&lt;p&gt;To make matters worse, we had this truly pointless team meeting every single week without fail where we did a round robin coming through details of what each of us was working on that week, and it was painful. Truly painful. I&amp;#39;m not talking a high level, I&amp;#39;m talking full PowerPoint slides, line by line description of what each and every one of us was working on, and it wasn&amp;#39;t with the director of our team. It was just with our manager. Utterly pointless meeting that wasted 2 hours of our time every week, and it was unanimously disliked across our whole team. But we still had to do it because the manager felt it was necessary. Why? Because I want it. Does it add anything to our performance or enhance anything, or do anything for us? No. Then why do it? Because I want to. Utter absurdity &lt;/p&gt;\n\n&lt;p&gt;I personally can&amp;#39;t condone working for someone You can&amp;#39;t feel comfortable around on a daily basis. It will really bother you long-term. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Red flag number 4: They don&amp;#39;t want you to advance your career for their own personal reasons&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I had a boss that told me they don&amp;#39;t want me to apply to other roles that are more senior, or that they don&amp;#39;t want me moving to another team in the company ever, they frown upon that, because they don&amp;#39;t like too much turnover. In other words, they don&amp;#39;t want to do their job as a manager or leader, and hire people. The other absurdity of saying something like this.... I wish I was joking, but I&amp;#39;m completely serious. A lot of leaders might not say it, because they think they are so clever they can just hide it from you. But for a lot of them, they have zero intention of letting you move up anywhere in the company no matter how well you perform. &lt;/p&gt;\n\n&lt;p&gt;Just sharing some of my own experiences in case it helps anyone during this time of really high turnover&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "b026063c-d780-11e7-aba9-0e030591a4b4", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2sptq", "author_is_blocked": false, "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#0079d3", "id": "17np0ou", "is_robot_indexable": true, "report_reasons": null, "author": "InevitableTraining69", "discussion_type": null, "num_comments": 14, "send_replies": true, "whitelist_status": "all_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/datascience/comments/17np0ou/there_are_some_red_flags_in_a_boss_or_manager/", "parent_whitelist_status": "all_ads", "stickied": false, "url": "https://old.reddit.com/r/datascience/comments/17np0ou/there_are_some_red_flags_in_a_boss_or_manager/", "subreddit_subscribers": 1112466, "created_utc": 1699114423.0, "num_crossposts": 0, "media": null, "is_video": false}}, {"kind": "t3", "data": {"approved_at_utc": null, "subreddit": "datascience", "selftext": "I'm doing a deep dive on cluster analysis for the given problem I'm working on. Right now, I'm using hierarchical clustering and the data that I have contains 24 features. Naturally, I used t-SNE to visualize the cluster formation and it looks solid but I can't shake the feeling that the actual geometry of the clusters is lost in the translation. \n\nThe reason for wanting to do this is to assist in selecting additional clustering algorithms for evaluation. \n\nI haven't used PCA yet as I'm worried about the effects of data lost during the dimensionality redux and how it  might skew further analysis.\n\nDoes there exist a way to better understand the geometry of clusters? Was my intuition correct about t-SNE possibly altering (or obscuring) the cluster shapes?", "author_fullname": "t2_131bi6", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "How can someone determine the geometry of their clusters (ie, flat or convex) if the data has high dimensionality?", "link_flair_richtext": [], "subreddit_name_prefixed": "r/datascience", "hidden": false, "pwls": 6, "link_flair_css_class": "network", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_17ngwrb", "quarantine": false, "link_flair_text_color": "dark", "upvote_ratio": 0.67, "author_flair_background_color": null, "subreddit_type": "public", "ups": 8, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Analysis", "can_mod_post": false, "score": 8, "approved_by": null, "is_created_from_ads_ui": false, "author_premium": false, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "content_categories": null, "is_self": true, "mod_note": null, "created": 1699085203.0, "link_flair_type": "text", "wls": 6, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.datascience", "allow_live_comments": false, "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m doing a deep dive on cluster analysis for the given problem I&amp;#39;m working on. Right now, I&amp;#39;m using hierarchical clustering and the data that I have contains 24 features. Naturally, I used t-SNE to visualize the cluster formation and it looks solid but I can&amp;#39;t shake the feeling that the actual geometry of the clusters is lost in the translation. &lt;/p&gt;\n\n&lt;p&gt;The reason for wanting to do this is to assist in selecting additional clustering algorithms for evaluation. &lt;/p&gt;\n\n&lt;p&gt;I haven&amp;#39;t used PCA yet as I&amp;#39;m worried about the effects of data lost during the dimensionality redux and how it  might skew further analysis.&lt;/p&gt;\n\n&lt;p&gt;Does there exist a way to better understand the geometry of clusters? Was my intuition correct about t-SNE possibly altering (or obscuring) the cluster shapes?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "8addf236-d780-11e7-932d-0e90af9dfe6e", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2sptq", "author_is_blocked": false, "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#dadada", "id": "17ngwrb", "is_robot_indexable": true, "report_reasons": null, "author": "WadeEffingWilson", "discussion_type": null, "num_comments": 20, "send_replies": true, "whitelist_status": "all_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/datascience/comments/17ngwrb/how_can_someone_determine_the_geometry_of_their/", "parent_whitelist_status": "all_ads", "stickied": false, "url": "https://old.reddit.com/r/datascience/comments/17ngwrb/how_can_someone_determine_the_geometry_of_their/", "subreddit_subscribers": 1112466, "created_utc": 1699085203.0, "num_crossposts": 0, "media": null, "is_video": false}}, {"kind": "t3", "data": {"approved_at_utc": null, "subreddit": "datascience", "selftext": "This is my first data job and I’m the only data science person there, sorry if the question is kinda obvious.\n\nHow would you approach explaining complex transformations if you don’t have anyone in your company who can review your code?\n\nWould it be smart to use graphical tools to illustrate each step and briefly explain methods used, such as right/inner joins? \n\nI’ve been working on this rather complex analysis in python with many steps and different queries. My project manager told me that he doesn’t feel confident with the results yet, due to the numerous (and sadly unavoidable) data transformation steps.", "author_fullname": "t2_6q7a2p0c", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "How would you explain complex data transformations to others?", "link_flair_richtext": [], "subreddit_name_prefixed": "r/datascience", "hidden": false, "pwls": 6, "link_flair_css_class": "discussion", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_17nlj1t", "quarantine": false, "link_flair_text_color": "dark", "upvote_ratio": 0.62, "author_flair_background_color": null, "subreddit_type": "public", "ups": 3, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Discussion", "can_mod_post": false, "score": 3, "approved_by": null, "is_created_from_ads_ui": false, "author_premium": false, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "content_categories": null, "is_self": true, "mod_note": null, "created": 1699104013.0, "link_flair_type": "text", "wls": 6, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.datascience", "allow_live_comments": false, "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is my first data job and I’m the only data science person there, sorry if the question is kinda obvious.&lt;/p&gt;\n\n&lt;p&gt;How would you approach explaining complex transformations if you don’t have anyone in your company who can review your code?&lt;/p&gt;\n\n&lt;p&gt;Would it be smart to use graphical tools to illustrate each step and briefly explain methods used, such as right/inner joins? &lt;/p&gt;\n\n&lt;p&gt;I’ve been working on this rather complex analysis in python with many steps and different queries. My project manager told me that he doesn’t feel confident with the results yet, due to the numerous (and sadly unavoidable) data transformation steps.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "4fad7108-d77d-11e7-b0c6-0ee69f155af2", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2sptq", "author_is_blocked": false, "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#1a1a1b", "id": "17nlj1t", "is_robot_indexable": true, "report_reasons": null, "author": "jeffrey_56", "discussion_type": null, "num_comments": 23, "send_replies": true, "whitelist_status": "all_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/datascience/comments/17nlj1t/how_would_you_explain_complex_data/", "parent_whitelist_status": "all_ads", "stickied": false, "url": "https://old.reddit.com/r/datascience/comments/17nlj1t/how_would_you_explain_complex_data/", "subreddit_subscribers": 1112466, "created_utc": 1699104013.0, "num_crossposts": 0, "media": null, "is_video": false}}], "before": null}}